{
  "https://solo-leveling.fandom.com/wiki/Sung_Jinwoo": {
    "url": "https://solo-leveling.fandom.com/wiki/Sung_Jinwoo",
    "content": "Sung Jinwoo | Solo Leveling Wiki | Fandom Start a Wiki Sign In Don't have an account? Register Sign In Solo Leveling Wiki Explore Main Page Discuss All Pages Community Interactive Maps Universe Arcs D-Rank Dungeon Arc Reawakening Arc Instant Dungeon Arc Dungeon & Lizards Arc Dungeon & Prisoners Arc Yoo Jinho Raid Party Arc Job Change Arc Red Gate Arc Demon Castle Arc Retesting Rank Arc Dungeons Cartenon Temple Demon Castle Hapjeong Subway Station Job Change Quest Dungeon Penalty Zone Gates Jeju Island S-Rank Gate First S-Rank Gate Tokyo S-Rank Gate Red Gate Incident Hunters Guild Gate Busan Gate Quests Collect Demon Souls! (1) Collect Demon Souls! (2) Courage of the Weak Job Change Quest Kill the Enemies Survival The Preparation To Become Powerful Terminologies Eternal Slumber False Rankers Guilds Mana Crystals Rune Stones Groups Countries China Japan Korea USA Organizations Korean Hunters Association Korean Hunters Auction Federal Bureau of Hunters Japanese Hunters Association Guilds Hunters Guild Fame Guild White Tiger Guild Fiend Guild Knights Guild Ahjin Guild Scavenger Guild Draw Sword Guild Races Humans Adam White Ahn Sangmin Laura Matsumoto Shigeo Norma Selner Park Kyung-Hye Sung Jinah Yoo Myunghan Hunters National Level Hunters Thomas Andre Liu Zhigang Christopher Reed Siddharth Bachchan S-Rank Hunters Sung Jinwoo Cha Hae-In Sung Il-Hwan Go Gunhee Baek Yoonho Choi Jong-In Lim Tae-Gyu Ma Dongwook Min Byung-Gyu A-Rank Hunters Woo Jinchul Kim Chul Lee Minsung Park Jongsoo Jung Yerim Jung Yoontae Yoo Soohyun Hanekawa B-Rank Hunters Kang Taeshik Lee Joohee Park Heejin C-Rank Hunters Cho Kyuhwan Go Myung-Hwan Hwang Dongsuk Lee Chul-Jin Song Chi-Yul Yoon Kijoong D-Rank Hunters Kim Sangshik Park Beom-Shik Yoo Jinho Joo Jae-Hwan Kang Jeongho E-Rank Hunters Han Song-Yi Magic Beasts Kandiaru Ant King Vulcan Baruka Blood-Red Commander Igris Esil Radiru High Orcs Ice Bears Kaisellin Kamish Shadows Beru Greed Igris Iron Kaisel Bellion Jima Tank Tusk Monarchs Antares Ashborn Baran Rakan Sillad Legia Querehsha Yogumunt Tarnak Community Administrators Handy Templates Wiki Rules Sign In Don't have an account? Register Sign In Explore Fan Central Current Advertisement Skip to content Solo Leveling Wiki 523 pages Explore Main Page Discuss All Pages Community Interactive Maps Universe Arcs D-Rank Dungeon Arc Reawakening Arc Instant Dungeon Arc Dungeon & Lizards Arc Dungeon & Prisoners Arc Yoo Jinho Raid Party Arc Job Change Arc Red Gate Arc Demon Castle Arc Retesting Rank Arc Dungeons Cartenon Temple Demon Castle Hapjeong Subway Station Job Change Quest Dungeon Penalty Zone Gates Jeju Island S-Rank Gate First S-Rank Gate Tokyo S-Rank Gate Red Gate Incident Hunters Guild Gate Busan Gate Quests Collect Demon Souls! (1) Collect Demon Souls! (2) Courage of the Weak Job Change Quest Kill the Enemies Survival The Preparation To Become Powerful Terminologies Eternal Slumber False Rankers Guilds Mana Crystals Rune Stones Groups Countries China Japan Korea USA Organizations Korean Hunters Association Korean Hunters Auction Federal Bureau of Hunters Japanese Hunters Association Guilds Hunters Guild Fame Guild White Tiger Guild Fiend Guild Knights Guild Ahjin Guild Scavenger Guild Draw Sword Guild Races Humans Adam White Ahn Sangmin Laura Matsumoto Shigeo Norma Selner Park Kyung-Hye Sung Jinah Yoo Myunghan Hunters National Level Hunters Thomas Andre Liu Zhigang Christopher Reed Siddharth Bachchan S-Rank Hunters Sung Jinwoo Cha Hae-In Sung Il-Hwan Go Gunhee Baek Yoonho Choi Jong-In Lim Tae-Gyu Ma Dongwook Min Byung-Gyu A-Rank Hunters Woo Jinchul Kim Chul Lee Minsung Park Jongsoo Jung Yerim Jung Yoontae Yoo Soohyun Hanekawa B-Rank Hunters Kang Taeshik Lee Joohee Park Heejin C-Rank Hunters Cho Kyuhwan Go Myung-Hwan Hwang Dongsuk Lee Chul-Jin Song Chi-Yul Yoon Kijoong D-Rank Hunters Kim Sangshik Park Beom-Shik Yoo Jinho Joo Jae-Hwan Kang Jeongho E-Rank Hunters Han Song-Yi Magic Beasts Kandiaru Ant King Vulcan Baruka Blood-Red Commander Igris Esil Radiru High Orcs Ice Bears Kaisellin Kamish Shadows Beru Greed Igris Iron Kaisel Bellion Jima Tank Tusk Monarchs Antares Ashborn Baran Rakan Sillad Legia Querehsha Yogumunt Tarnak Community Administrators Handy Templates Wiki Rules in: Rulers , Monarchs , S-Rank , and 5 more Ahjin Guild Korea Human Alive Hunters Sung Jinwoo View source History Purge Talk (1) “ I'm going to protect my family, even if it means turning all the hunters in the world against me. ” —Sung Jinwoo to Liu Zhigang , Chapter 148 ( Webtoon ) Overview History Items Relationships Gallery Webtoon Anime Sung Jinwoo Hangul 성진우 Debut Chapter 1 NV Chapter 1 WB Episode 1 AN Epithets The Weakest Hunter of All Mankind [ 1 ] Korea's 10th S-Rank Hunter [ 2 ] Shadow Monarch 6th National Level Hunter The Ghost [ 3 ] 2nd Rate Asian Hunter [ 4 ] Status Alive (Resurrected) Personal Information Age 20-25 (Original Timeline) 40-45 (Revised Timeline) 80-85 (Chronologically) Gender Male Race Human Address Korea Relatives Sung Il-Hwan (Father) Park Kyung-Hye (Mother) Sung Jinah (Sister) Cha Hae-In (Wife) Yoo Jinho (Brother-In-Law) Sung Suho (Son) Occupation Hunter Guild Master Shadow Monarch Detective (Post-Time Reversal) Rank S-Rank Class Mage Affiliations Affiliations Ashborn Rulers Monarchs System Status Guild Job Necromancer Shadow Monarch Skills Skills Will To Recover Longevity Immunity Detoxification Tenacity Advanced Dagger Techniques Stealth Bloodlust Quicksilver Mutilation Dagger Rush Ruler's Authority Dragon's Fear Job Specific Skills Job Specific Skills Shadow Extraction Shadow Preservation Shadow Exchange Monarch's Domain Shadows Summons Igris Tank Iron Tusk Kaisel Beru Jima Kamish (Temporarily) Greed Bellion Weapons & Equipment Weapons Kasaka's Venom Fang Knight Killer Baruka's Dagger Demon King's Daggers Demon King's Longsword Kamish's Wrath Antares' Fangs Portrayal Korean Min Seung-woo Japanese Taito Ban English Aleks Le Sung Jinwoo (성진우) is the main protagonist of Solo Leveling . He is the strongest hunter in the world and the second Shadow Monarch, having inherited the position from his predecessor Ashborn . Originally an infamously weak E-Rank Hunter , Jinwoo got the chance of a lifetime when he was selected as the Player of the System , giving him the unique ability to grow in strength without restraint. As a result, by taking advantage of the opportunities offered to him by the System, Jinwoo eventually rose to power as humanity's greatest hunter. Contents 1 Appearance 2 Personality 3 Abilities 4 Skills 4.1 Passive Skills 4.2 Active Skills 4.3 Job Skills 5 Trivia 6 References 7 External Links 8 Site Navigation Appearance Jinwoo is a tall, handsome, and muscular young man with gray eyes, sharp facial features, and black hair with bangs that dangle all the way down to his eyes. When using his powers or feeling intense emotions, his eyes glow purple and his facial features become more pronounced. He favors dark clothing and often seen in sleek and stylish outfits ranging from tailored suits to long hooded coats. After defeating the Monarchs in the revised timeline created by the Cup of Reincarnation , he also starts wearing a black glove on his left hand to cover up the burn scars that he received there during his rematch with Antares . [ 5 ] Before he was chosen as the Player of the System, Jinwoo had a very different appearance. He was shorter and had a noticeably thinner physique, with long, bushy hair that covered up his ears. His face was very boyish, which made him look even younger than his sister Jinah (who was still a teenager at the time), and he tended to dress in casual attire, favoring a simple blue hoodie and jeans. It was also common to see him wearing bandages on his arms and legs due to the frequent injuries that he received on raids. Personality Jinwoo is a humble and benevolent individual who cares deeply for his family and has an ardent desire to become stronger. As a result, he shares a close relationship with his sister and his mother, and rarely wastes an opportunity to refine his skills and gain more power. His deep bond with his family also makes him absolutely merciless towards anyone who dares to hurt them, as displayed when he massacred Groctar and his minions for attempting to kill Jinah, and murdered Hwang Dongsoo for torturing Jinho . It should be noted that despite being the strongest hunter in the world, Jinwoo is not particularly arrogant and is both polite and easygoing in-person. He is also mostly indifferent to materialistic desires and can be very selfless, as displayed when he teleported to Jeju Island without a second thought to save the other Korean S-Rank Hunters from certain death. In battle, however, he is ruthless, as he tends to slaughter his enemies indiscriminately, and even somewhat disdainful, as displayed when he taunted the Ant King by calling him a \"mere insect\" and mocked Kandiaru for the flaws he made in his design of the System. In contrast, back when he was weak, Jinwoo was very timid and insecure due to his incompetence as a hunter and his troubled financial situation. Although he cared deeply for his family and spent years risking his life going on raids for their sake, he was secretly ashamed of his circumstances, as displayed when he lied to Joohee about why he had chosen hunting as his career path. However, his traumatizing experience in the Double Dungeon would give him everything he needed to become stronger, and being betrayed and left to die by his fellow hunters while trapped inside the dungeon would teach him the harsh lesson that his kindness could be exploited by others for their own benefit. As a result, from that point on, Jinwoo vowed to never again recklessly endanger his own life under the guise of the greater good and adopted a more self-preserving stance as a hunter, primarily focusing on amassing strength and eventually growing into the fearsome warrior that he is today. Abilities As the second Shadow Monarch, Jinwoo is the strongest hunter in the world and arguably one of the strongest beings in existence. Immeasurable Strength: Jinwoo possesses a tremendous amount of physical strength. Even before obtaining his true power, he was strong enough to critically damage the Statue of God with just a few punches to its face and beat Thomas Andre , one of the five National Level Hunters , to the brink of death with just his bare hands. Upon being revived by Ashborn and receiving the full extent of the Shadow Monarch's powers, Jinwoo's strength was increased to the point that he was able to effortlessly repel Sillad 's attacks with one hand, kill Rakan in just four blows, and hold his own against Antares, the strongest and oldest of the nine Monarchs, in battle. After spending 27 years waging war against the Monarchs in the revised timeline, Jinwoo has appeared to have grown even more powerful than before, as shown by how he was able to kill Antares completely by himself instead of having to rely on the Rulers for support. [ 6 ] Immeasurable Speed: Jinwoo is unfathomably fast and can move at speeds so great that most opponents are unable to track his movements. As a testament to this, he was agile enough to keep up with Sillad's attacks during their second confrontation and upon obtaining his true power, was able to strike at Rakan with such speed that the latter didn't even realize that he'd been attacked until after Jinwoo cut off one of his legs. Immense Durability: Jinwoo is incredibly resilient to physical damage. He was virtually unharmed when the Ant King punched him in the face, only sustaining a small cut on his lip, and was physically unscathed after Baran smashed him into the ground with great force. Combat Mastery: Jinwoo is a master of melee-based combat and his fighting skills are so refined that he can hold his own against enemies with far more combat experience than he does with little trouble. This was first demonstrated during his battle with Kandiaru in the Double Dungeon ; despite the fact that his opponent had been alive for hundreds of years and fought against numerous opponents in his time, Jinwoo was still able to match him in battle and eventually overpower him altogether. Later on, Jinwoo was also able to keep up and defend from Sillad's attacks, despite the fact that the latter had his Spiritual Body Manifestation activated and eons of fighting experience under his belt, and probably would've been able to land a killing blow had Rakan not ambushed him from behind. Agelessness: As an effect of having inherited Ashborn's powers, Jinwoo no longer ages naturally and has to biologically alter his body to look the age he wants. [ 7 ] As a result, by the end of the series, he only appears to be in his thirties when he has actually been alive for over 80 years. Accelerated Development: Jinwoo's most astonishing ability is his explosive growth rate, a power unlike any other in the world. Not only does he grow stronger with every battle, but he also receives a massive boost in strength with each victory that he achieves. As a result of this, it only took him a few months of intensive training with the System to become one of the strongest hunters in Asia. Umbrakinesis: Jinwoo possesses absolute control over shadows and darkness, and can reshape them into any form he desires, as displayed when he created a layer of black armor made of shadows onto his body. [ 8 ] Memory Manipulation: Jinwoo can manipulate the memories of other humans to a certain extent by making physical contact with them. So far, he has been shown to be able to erase certain memories from their minds, grant them their memories of the original timeline, and allow them to see into his own memories, as he did with Woo Jinchul to inform him of the existence of the Rulers and the Monarchs. Hypnosis: Jinwoo can hypnotize people into following the orders that he gives them by snapping his fingers, as displayed when he hypnotized Kim Chul into letting him go and becoming a better person when they encountered each other in the new timeline. [ 9 ] However, since he has only ever been shown using this ability once, the limitations to it remain unknown. Gate Creation: Jinwoo can open gates to other worlds. These gates are black and purple in color, and he can open numerous gates at the same time. Unlimited Inventory: Jinwoo can store an unlimited number of items in his shadow and extract any number of those items for his own use at any point in time. Monster Language Fluency: Jinwoo can speak and understand monster tongue, which he uses to communicate with his shadow soldiers and the enemy monsters that he encounters in battle. Indomitable Will: Due to his loving relationship with his family and his intense drive to become strong for their sake, Jinwoo has an extraordinary level of willpower. He has exemplified this trait even before he became the Player of the System, as shown by how he spent four years going on dungeon raids to financially support both his sister and his mother even though he nearly died on almost every raid he ever went on. Jinwoo's resolve to continuously put his life as risk for the welfare of his family was also ultimately the reason why Ashborn selected him as his successor, as he knew that Jinwoo would never quit fighting for his family no matter how high the odds were stacked against him. [ 10 ] Skills Passive Skills Will To Recover: Jinwoo can regenerate from any kind of damage done to his body with the exception of fatal wounds, such as being stabbed through the heart. This also includes lost limbs, as shown by how Jinwoo was able to completely regenerate his right leg after he lost it during the first Double Dungeon Incident. [ 11 ] Longevity: Jinwoo is immune to all diseases, poisons, and any abilities that can be harmful to his status. His regeneration speed is also far faster than a normal  human's and increases exponentially when he sleeps. [ 11 ] Detoxification: Jinwoo's body is able to automatically cleanse itself of any poisons once they are detected in his bloodstream. Unfortunately, alcohol is considered to be a poison and as a result, Jinwoo can't get drunk. [ 11 ] Tenacity: If Jinwoo's health drops below 30% in battle, any further damage that he receives will be reduced by 50% in order to keep him alive. [ 12 ] Advanced Dagger Techniques: If Jinwoo uses his daggers in battle, any damage he inflicts on his opponent will be increased by 33%. [ 13 ] Active Skills Stealth : Jinwoo can camouflage with his surroundings and hide all traces of his presence, essentially turning himself both physically and magically invisible. Bloodlust : Jinwoo can magically intimidate an enemy combatant into submission, inducing intense fear into those who are targeted by this technique and decreasing their stats by 50%. It can also be used on multiple opponents at once. [ 14 ] Quicksilver : Jinwoo can increase his speed by 30% for a short period of time. Mutilation : Jinwoo aims for a target's vital points before slashing away at them with his daggers, inflicting critical damage. [ 15 ] Dagger Rush : Jinwoo barrages a target with his daggers from all directions. [ 16 ] Ruler's Authority : Jinwoo can move and control objects via telekinesis. [ 17 ] He can also use this skill on the air around him, enabling him to move and dodge attacks while airborne. Dragon's Fear : Jinwoo releases a mana-infused shout from his soul, driving anyone weaker than him into a state of intense despair and panic. [ 18 ] Job Skills Shadow Extraction : Jinwoo can extract shadows from the corpses of his enemies and add them into his army. [ 19 ] Shadow Preservation : Jinwoo can preserve his shadows in storage and monitor them by perceiving their senses. [ 20 ] Shadow Exchange : Jinwoo can use shadows as portals to travel vast distances in an instant. [ 21 ] Monarch's Domain : Jinwoo can increase the strength of all of his active shadow soldiers by 50% in battle. [ 22 ] Trivia In the Japanese version of the anime, Sung Jinwoo's name is changed to Shun Mizushino (水篠旬). In the anime, the skill Bloodlust is referred to as Murderous Intent. In a dream sequence that Jinwoo has in the revised timeline where Antares fully possesses his body, it is heavily implied that due to having successfully grown strong enough through the System to harness Ashborn's powers, he could have done the exact same thing with Antares and served as the latter's human vessel without any trouble. Strangely enough, in Jinwoo's dream, he was pictured with the exact same stats that he had as an E-Rank Hunter and yet Antares was somehow able to fight at full power without causing any kind of blowback to his body. [ 23 ] References ↑ Solo Leveling Webtoon : Chapter 1 ↑ Solo Leveling Webtoon : Chapter 62 ↑ Solo Leveling Webtoon : Chapter 190 ↑ Solo Leveling Novel : Chapter 177 - A disdainful nickname given by Christopher Reed . ↑ Solo Leveling Webtoon : Chapter 181 ↑ Solo Leveling Webtoon : Chapter 179 ↑ Solo Leveling Webtoon : Chapter 183 ↑ Solo Leveling Webtoon : Chapter 175 ↑ Solo Leveling Webtoon : Chapter 185 ↑ Solo Leveling Webtoon : Chapter 163 ↑ 11.0 11.1 11.2 Solo Leveling Webtoon : Chapter 25 ↑ Solo Leveling Webtoon : Chapter 27 ↑ Solo Leveling Webtoon : Chapter 36 ↑ Solo Leveling Webtoon : Chapter 24 ↑ Solo Leveling Webtoon : Chapter 103 ↑ Solo Leveling Webtoon : Chapter 151 ↑ Solo Leveling Webtoon : Chapter 126 ↑ Solo Leveling Webtoon : Chapter 173 ↑ Solo Leveling Webtoon : Chapter 45 ↑ Solo Leveling Webtoon : Chapter 123 ↑ Solo Leveling Webtoon : Chapter 88 ↑ Solo Leveling Webtoon : Chapter 73 ↑ Solo Leveling Webtoon : Chapter 189 External Links Sung Jinwoo on the Solo Leveling: ARISE Wiki Sung Jinwoo on the Heroes Wiki Site Navigation Korean Guilds Ahjin Guild | Fame Guild | Fiend Guild | Hunters Guild | Knights Guild | White Tiger Guild Ahjin Guild Hunters Sung Jinwoo (Guild Master) | Yoo Jinho (Vice-Guild Master) | Yoo Soohyun Categories Categories : Rulers Monarchs S-Rank Ahjin Guild Korea Human Alive Hunters Community content is available under CC-BY-SA unless otherwise noted. More Fandoms Fantasy Advertisement Explore properties Fandom Muthead Fanatical Follow Us Overview What is Fandom? About Careers Press Contact Terms of Use Privacy Policy Digital Services Act Global Sitemap Local Sitemap Community Community Central Support Help Advertise Media Kit Contact Fandom Apps Take your favorite fandoms with you and never miss a beat. Solo Leveling Wiki is a FANDOM Anime Community. View Mobile Site Follow on IG TikTok Join Fan Lab"
  },
  "https://hero.fandom.com/wiki/Sung_Jinwoo": {
    "url": "https://hero.fandom.com/wiki/Sung_Jinwoo",
    "content": "Sung Jinwoo | Heroes Wiki | Fandom Heroes Wiki -Welcome to the Hero/Protagonist wiki! If you can help us with this wiki please sign up and help us! Thanks! -M-NUva READ MORE Start a Wiki Sign In Don't have an account? Register Sign In Heroes Wiki Explore Main Page Discuss All Pages Community Interactive Maps Recent Blog Posts Top Content Most Popular Heroes Sung Jinwoo Doey the Doughman The Maxx Thaedus Invincible Butterfly People Jinta Newly Changed Articles Wreck-It Ralph The Ancients (Sonic the Hedgehog) Lucy Tucci/Gallery Sandbar Seishiro Nagi Sky Beak Shrek (DreamWorks) Headlined Hero - Marth Community Rules Discord™ Featured Users KYLIE1114 Drake Gunderson AlexHoskins Sl453128 LordGalvatronYT RussSmalls2008 Recent Blogs Recent Changes Affiliates Staff Bureaucrats Emeraldblade95 Jester of Chaos Administrators Alexhoskins DarkUnknownWarrior Kyurem147 Mesektet Mrs. Super Nova Robergestudios The Humble Nintendo Master Moderators Jaxnys NerdWithAKeyboard ShockwaveDude120 Pure Good Terms Pure Good Criteria Pure Good Proposals Proposal Permissions Discussion Dates Sign In Don't have an account? Register Sign In Explore Fan Central Current Advertisement Skip to content Heroes Wiki 47,437 pages Explore Main Page Discuss All Pages Community Interactive Maps Recent Blog Posts Top Content Most Popular Heroes Sung Jinwoo Doey the Doughman The Maxx Thaedus Invincible Butterfly People Jinta Newly Changed Articles Wreck-It Ralph The Ancients (Sonic the Hedgehog) Lucy Tucci/Gallery Sandbar Seishiro Nagi Sky Beak Shrek (DreamWorks) Headlined Hero - Marth Community Rules Discord™ Featured Users KYLIE1114 Drake Gunderson AlexHoskins Sl453128 LordGalvatronYT RussSmalls2008 Recent Blogs Recent Changes Affiliates Staff Bureaucrats Emeraldblade95 Jester of Chaos Administrators Alexhoskins DarkUnknownWarrior Kyurem147 Mesektet Mrs. Super Nova Robergestudios The Humble Nintendo Master Moderators Jaxnys NerdWithAKeyboard ShockwaveDude120 Pure Good Terms Pure Good Criteria Pure Good Proposals Proposal Permissions Discussion Dates in: Spoilers , Mature , Solo Leveling Heroes , and 88 more Male Webcomic Heroes Book Heroes Strong-Willed Fighters Assassins One-Man Army Warriors Chopsocky Heroes Revived Rescuers Lethal Loyal Wealthy Fortune Hunters Big Good The Messiah Force of Nature The Chosen One Determinators Famous Successful Protectors Protectors of Innocence Successors Adventurers Thrill-Seekers Summoners Monster Slayers The Hero Magic Siblings Power Hungry Arrogant Dreaded Wrathful Titular Honest Neutral Good Mercenaries Truth-Seekers Tricksters Pragmatists Virtually Resourceful Dimension Travelers Leaders Officials Businessmen Provokers Monarchs Paranormal Master Orator Masterminds Wayward Heroes Manhwa Heroes Anime Heroes TV Show Heroes Parents Casanova Superheroes Elementals Creators Good Vs. Good Localized Protection Immortals Victims Action Heroes Berserkers Global Protection Anti-Heroes Possessed/Brainwashed Philanthropists Honorable Legacy Hope Bringers Bond Protectors Cosmic Entity Rogues Movie Heroes Crossover Heroes Cosmic Protection Animal Kindness Insecure Brutes Freedom Fighters Master of a Villain Tragic Scapegoat English Français Italiano Polski Sung Jinwoo Sign in to edit History Purge Talk (0) ✔ This Article Contains Spoilers - \nWARNING: This article contains major spoilers. If you do not wish to know vital information on plot / character elements in a story, you may not wish to read beyond this warning: We hold no responsibility for any negative effects these facts may have on your enjoyment of said media should you continue. That is all. This article's content is marked as Mature Sung Jinwoo contains mature content that may include coarse language, sexual references, and/or graphic violent images which may be disturbing to some. Mature articles are recommended for those who are 18 years of age and older. If you are 18 years or older or are comfortable with graphic material, you are free to view this page. Otherwise, you should close this page and view another page. Hero Overview Gallery Do-gooder Reawakened Awakened Shadow Monarch Full Name Sung Jinwoo (original; 성진우, Korean) Shun Mizushino (Japanese version) Alias(es) Original timeline Player Player of the System Hunter Sung Jinwoo E-Rank Hunter Boss (by Jinho) World's Weakest Hunter My Liege (by Beru) The One Who Overcame Adversity Wolf Slayer South Korea's 10th S-Rank Sixth National Level Hunter World's Strongest Hunter Demon Hunter Monarch of the Shadows The Ghost 2nd Rate Asian Hunter (by Christopher Reed, out of disdain) King of the Dead Revised timeline The Phantom Dad (by Suho) Origin Solo Leveling Occupation Original timeline Hunter Guild leader Shadow Monarch Shadow Monarch vessel (formerly) Leader of his Shadow army Revised timeline Middle school student (expelled; due to his long absence) High school student (formerly) Detective Powers / Skills Indomitable will Charisma Genius-level intelligence Leadership Master strategist Skilled Tactician Combat Intelligence Awakened Being Enhanced condition Low mana Leadership Luck Reawakened Human/\"Player\" of the System Limitless power growth Superhuman intelligence Master-hand-to-hand combat Superhuman condition Nigh-unlimited strength Nigh-unlimited speed Enhanced agility and acrobatic Dagger proficiency and advanced arts Dagger throwing Telekinesis Invisibility System Shop Unlimited Inventory Ruler's Authority Immense mana and intimidation Immense durability Immense stamina Nigh-unlimited regeneration (via potions) Bloodlust Shadow Monarch Powers Immortality Self-age and appearance manipulation Reanimation Limited creation Unlimited shadow storage Nigh-omnipotence Shadow summon Shadow save Teleportation between shadows Shadow preservation Shadow domain summoning Dragon's Fear Body aging manipulation Longevity Hobby Leveling up and getting stronger. Fighting and killing monsters, criminals and corrupt hunters. Spending time with his family and friends. Clearing dungeons. Goals Continue leveling up and learning about the origin of the System (succeeded) . Defeat Antares and the Monarchs (succeeded) . Protect and take care of his family and friends. Live a normal life (succeeded; both ongoing) . Defeat the Itarim Have Beru train Suho (both ongoing) . Family Pre-Time Reversal Sung Il-Hwan (father) Park Kyung-Hye (mother) Sung Jinah (younger sister) Post-Time Reversal Cha Hae-In (wife) Sung Suho (son) Yoo Jinho (brother-in-law) Unnamed niece Friends / Allies Cha Hae-In (love interest, later wife) Yoo Jinho (best friend) Ashborn (predecessor) Song Chi-Yul Rulers Lee Joohee Lennart Niermann Liu Zhigang Min Byung-Gyu Han Song-Yi Go Gunhee Park Gi-Sool Park Hee-Jin Choi Jong-In Thomas Andre Esil Radiru Son Kihoon Gina Shadow Soldiers Igris Beru Tusk Tank Jima Bellion Iron Kamish (briefly) Enemies Hunters Thomas Andre (briefly) Hwang Dongsoo Hwang Dongsuk Cho Kyuhwan Kang Tae-Shik Kim Chul Goto Ryuji Magical Beasts Blood-Red Commander Igris High Orcs Kargalgan Metus Groctar Vulcan Statues Statue of God Architect Ants Ant King Ice Elves Baruka Monarchs Antares (arch-nemesis; evil counterpart) Rakan Tarnak Querehsha Sillad Yogumunt Legia A clone of Baran Titans Itarim Type of Hero Pragmatic Dimensional Traveler “ The owner of that throne is long gone, stop guarding an empty seat... how about protecting me, the man standing before you? Arise . „ ~ Jinwoo extracts Blood-Red Commander Igris ' shadow. “ I'm going to protect my family, even if it means turning all the hunters in the world against me. „ ~ Sung Jinwoo to Liu Zhigang . “ Since you call yourselves hunters, are you ready to be hunted? „ ~ Sung Jinwoo to Hwang Dongsuk and his squad. Sung Jinwoo (성진우, seong jin-wu ) or Shun Mizushino (in the Japanese version)  is the main protagonist of the web novel-turned-webtoon Solo Leveling and the overarching protagonist of its sequel Solo Leveling: Ragnarok . [1] He is one of the awakened humans who became able to use mana, but ranked as the World's Weakest Hunter , being the weakest E-Rank Hunter.  Following the traumatic experience of survival inside the Double Dungeon, Jinwoo became the \" Player \" of the System , a magical program that only he has access to that grants him unique overpowered abilities that no other hunters on Earth has. Now, Jinwoo soon delved down the path of becoming the World's Strongest Hunter after he was Reawakened, later revealed to be the System's purpose to make him into the next Shadow Monarch. He is voiced by Taito Ban (who also voiced Glasses from One-Punch Man ) in Japanese, by Seung-woo Min in Korean, and by Aleks Le (who also voiced Zenitsu Agatsuma from Demon Slayer and Shen Xiang from Undead Unluck ) in English. Contents 1 Appearance 1.1 Full Body Manifestation 1.2 Revised Timeline 2 Personality 3 Biography 4 Powers and Abilities 4.1 The System 4.2 Powers 4.3 Active Skills 4.3.1 Shadow Monarch Powers 5 Equipments 6 Relationships 6.1 Family 6.2 Hunters 6.3 Recruited Major Shadows 7 Quotes 8 Trivia 9 External Links 10 See Also 11 Navigation Quick Answers What traumatic event led to Sung Jinwoo becoming the 'Player' of the System? Initially an E-Rank Hunter, Sung Jinwoo faced numerous life-threatening situations in dungeons. His Reawakening occurred in the Double Dungeon, where he was prepared to sacrifice his life for others. Post this event, Sung Jinwoo became the only 'Player' of the System, a mechanism that let him level up and enhance his strength, akin to a gamer. Provided by: Fandom How did Sung Jinwoo transition from being the World's Weakest Hunter to gaining unique powers? Sung Jinwoo, once the World's Weakest Hunter, experienced a Reawakening in the Double Dungeon. This event made him a player of the System, a program exclusive to him. The System granted him extraordinary powers and the ability to level up, enhancing his physical strength. Post Reawakening, Sung Jinwoo began his journey to become the World's Strongest Hunter. Provided by: Fandom What does the 'System' in Solo Leveling grant to Sung Jinwoo? In Solo Leveling, Sung Jinwoo utilizes a unique program called the 'System'. This allows him to level up and gain strength, akin to a video game character. The System presents Jinwoo with quests and trials, rewarding him with new abilities upon completion. After a pivotal Class Change Quest, he became a Necromancer, later evolving into the hidden class, Shadow Lord, granting him the power to resurrect fallen enemies and individuals. Provided by: Fandom What is the significance of the Double Dungeon in Sung Jinwoo's character development? The Double Dungeon plays a crucial role in Sung Jinwoo's evolution. Initially, Jinwoo was less powerful than his fellow Hunters, facing near-death experiences in low-level Dungeons. His Reawakening in the Double Dungeon, however, turned him into a Player, enabling him to level up and gain strength. This shift not only boosted his confidence and courage but also highlighted his selflessness, as he was ready to risk his life for the survival of others. Provided by: Fandom How does Sung Jinwoo's character evolve throughout the Solo Leveling series? In Solo Leveling, Sung Jinwoo starts as a wary individual, particularly about the system. His character evolves to become bolder and more confident, shedding his initial caution. Despite this transformation, he maintains his caring and thoughtful nature. Notable changes include increased confidence, bravery, and a colder demeanor towards monsters and hostile hunters. As Sung Il-Hwan and Park's eldest child, Jinwoo's character development is central to the series. Provided by: Fandom Appearance [ ] Sung Jinwoo started off as an average-looking young man of average height with a skinnier, weaker build, but still stronger than a normal person. Upon his Reawakening, becoming a player of the System, Jinwoo went from the appearance of an frail teenage boy drastically into a lean young man with a well-developed physique, as a result of the System assisting in his growth to make him stronger. He now became a rather tall and handsome young man able to attract the attention of most woman. Although, at first, his wore basic clothing because of his lack of funds since gaining more money and access to the System Shop, he gained access to various items and clothing that no other Hunter has access too. Most of the clothing that he wears ranging from wearing black clothing that fits his current mindset and abilities. Full Body Manifestation [ ] By activating his full body manifestation form, Jinwoo's entire body is covered by the dark and and purple mana-infused armor making him ressembling a lot to the original Shadow Monarch. Sharp glowing purple eyes and with no mouth visible, and what it appears to be his hair in glowing purple floating upward. His torso, arms and shoulders feature sharp glowing scales and like his predecessore, he has a cape on his left shoulder, hiding his left arm. Revised Timeline [ ] After ordering the Rulers to use the Cup of Reincarnation to reset the world's state as it was back to ten years ago, to kill all the Monarchs once again for the second time on his own. After coming victorious, Jinwoo reversed his appearance to a middle school boy to attend school. However, the burns on his right hand following his final battle against Antares remained visible and decided to wear a black glove to avoid attention. Personality [ ] From the start, Jinwoo is shown to be rather kind, brave, and compassionate, going through dungeons to pay for his mother's hospital fees and take care of his sister at the same time. He was also tense as a result of his under-average capability compared to average hunters and is quick to accept that he was weak as shown when he overheard his comrades talking about his lack of powers as a hunter. Although, he was reckless and at times nervous around his fellow Hunters who he ventured with, but he could also be rather analytical and smart even in the most tense situations, which allowed him to rescue the survivors of the Double Dungeon. Jinwoo was also willing to sacrifice himself so that the two who remained with him could escape, knowing neither of them were capable of escaping without assistance, however, he was secretly frightened and didn't want to die as he had a family himself. Following his Reawakening and becoming a Player, his mindset started changing with his continued fighting. He has become more bold and confident in his abilities. He at first was estranged about the system, being wary and cautious about it. This caution and wariness later dissipate. His personality however, remains almost unchanged as he is shown to be caring and thoughtful, he just doesn't show it as much as he did back then. He has had a few positive changes though, such as confidence, courageousness and coldness towards monsters and hostile hunters. The most notable trait that wasn't changed by the System; the love of his family, so deep that he became more ruthless when threatened of his family, thrice: Demonstrated that he abandons the raid due to sensing Jinah is in danger, despite the hunters' opposition, he became cold and angry when trying to stop him, easily scaring them by letting Beru lead them, as massacred Groctar and his minions for attempting to kill Jinah, killed Dongsoo for his torture of Jinho, and later threatened the whole hunters of different countries to protect his father from being hunted. This trait was the reason why Ashborn chose him, as Jinwoo defies death many times due to his bond of his family, as even the Grand Marshal Bellion acknowledges this, reminding of how his previous king acted when protecting the Absolute Being despite its malevolence Biography [ ] Sung Jinwoo is the oldest child of Sung Il-Hwan and Park Kyung-Hye, as well as the older brother of Sung Jinah. His father who worked as a firefighter who soon awakened, then started going into the Dungeon as a means of making money, but soon vanished. After his mother who became afflicted with the Eternal Slumber Disease , Jinwoo who graduated started working in the Dungeons to pay for her hospital bills and take care of his younger sister. However, because he was the weakest hunter even for an E-Rank, he undergoes near-death experiences in various situations, most of them being weaponless or starving in the dungeons. Powers and Abilities [ ] “ The System will use me and I will use the System „ ~ Jinwoo accepting the System to use him. The System [ ] Jinwoo interacting with the System. Sung Jinwoo is the sole \"Player\" and only host of the mysterious program in the world. As a result, only he can see the interface and messages that the System provides him whenever it appears right in front of him, being invisible to others. As a whole, the System basically works like a real life video game or a virtual reality that can be interacted just by touching. Not even the Monarchs or the Rulers were aware of the System's existence in the entire series. The only one who knew the program's existence were, aside from Jinwoo, were Ashborn and the Architect, the creator of the progam. The System provides its host daily quest each day. It grants him rewards in return for completing them and an exclusive inventory to store his items. Although, only a few quests made its appearances in the series, which were: \" Courage of the Weak \" - The first quest the Player receive by becoming the host of the program after volunteering to sacrifice himself in the Double Dungeon. \" The Preparation To Become Powerful \" - The typical daily quests that Jinwoo receives that provides him great rewards. The goals of the quest are: 100 pushup, 100 sit-ups, 100 squats, and 100 run. Like a video game, it has a time limit of 24 hours/1 day. If failed to complete it or if the time limit is up when the quest is unfinished, the host is sent to the Penalty Zone by receiving another quest - the \"Penalty Quest\". Once completed, Jinwoo receives the rewards, which are \"Statue Recovery\", +3 Stats points, Random loot box. \" Kill the Enemies \" - The System notifies Jinwoo that enemies (either hunters or magical beasts) have been detected and is tasked to kill them. \" Job-Change Quest \" - Upon reaching level 40, this quest will appear and asks Jinwoo to enter and clear the dungeon of the same name. Inside, the Job-Change Quest Dungeon, there are knights and mages, unalike from most dungeons. After beating the dungeon's boss, Blood-Red Commander , a final stage of the dungeon will ask him to survive the as long as he can while knights and mages are being summoned. The longer he does, the more point he acquires to reach a higher level. \" Penalty Quest \" - A special quest that serves as punishment once the host fails to complete the given quest. It sends the player into a deserted environment where he is forced to run for his life as a enormous centipede pursues the player. Powers [ ] “ Michael Connor : Mrs. Selner, what happened? Norma Selner : He... He is... He is a king. And a very powerful one... Michael Connor : Then... does that mean he's about the same level as the National Level Hunters? Norma Selner : No, I'm not sure. I've never experienced this before. He is a king, but he's different than the others. When I looked into him, he was also looking back at me. It wasn't Hunter Sung Jinwoo, but rather it was it the endless darkness inside him.. It was looking at me!! And... he... he does not have a limit... „ ~ Norma Selner explaining in fear about what she saw when trying to see Jinwoo's limits, only to discover that he does not have one. Although, Sung Jinwoo was an Awakened Human with physical prowess higher than that of normal humans, he was weaker than other Hunters of higher rankings and almost died several times inside of lower-level Dungeons. However, following his Reawakening in the Double Dungeon, he became a player, which allowed him to level up and become stronger almost as if he were a gamer. Since then, Jinwoo has leveled up higher and higher through playing through the various dungeons and special ones he alone had access to, achieving skills and abilities using the System, which was also using him. Following his Class Change Quest, Jinwoo was offered the position of Necromancer which soon evolved into the hidden class, Shadow Monarch. Following this, he became able to revive his deceased enemies and people to turn them into his Shadows, servants who serves and fights alongside him in combat, however, he is incapable of reviving those stronger than him or demonic beings who have corrupted mana. Since achieving this Job, Jinwoo attained a wide assortment of Shadows from powerful foes who fights alongside him. He is capable of giving names to the Elite Shadows. The true purpose for the Architect creating the System was to find a host strong enough to become the vessel for the Shadow Monarch, which slowly modifies his body by utilizing the power of the Shadow Monarch, Ashborn . Following his completion of the Final Trial of the Architect and attaining the original Shadow Monarch's Black Heart, Jinwoo then became the Shadow Monarch, the original Monarch was not reborn. After his heart was pierced and encountering Ashborn, he left all his powers to Jinwoo, which resulted releasing the System, granting him access to all his power. Supernatural Condition: Following his Awakening, Jinwoo gained heightened physical abilities above a normal human, but lower than Hunters. Fast  and Unlimited Growth: After his reawakening, and because of the leveling system, his various physical capabilities becomes even more heightened the more he levels up and put points into his stats. He could content with some of the strongest hunters and monsters, surpassing  National-Level Hunters, until he became a superior cosmic being that surpassed his kind, the Monarchs, including Antares, even the Rulers were fearful of his strength and unlimited development. Immense Mana: Although, his mana was weaker than normal E-Ranks, following his leveling up, and putting points into his Intelligence stats, his mana has grown to the point where he could be classified as one of the S-Rank Hunters, his level being stated to be either above S and National-Level Hunters, it was further increased with the Black Heart and his ascension of being the new Shadow Monarch, to the point that he kept regenerating a whole massive army of his shadows. Unlimited Inventory: Because of the System, Jinwoo has access to a limitless storage akin to a dimensional storage, where he can store endless items, thus removing the need for him to carry anything on him. System Shop: After reaching a certain level, he gained access to the item shop, where he can acquire various items ranging from clothes, weapons, armors, and support items such as high-end healing potions. Kandiaru's Blessing: After his reawakening, Jinwoo earned a passive skill, which will always keep him strong and healthy. Even if he loses a limb, it'll recover after a period of time through Will to Recover. And Longevity , which makes him immune to all diseases, poisons, and other abnormalities, as well as his natural regenerative abilities all being enhanced, while sleeping. Indomitable Will: Jinwoo's bond for his family is what made him go through difficult trials to protect and provide for his family, even before becoming a Player, and this is also Ashborn's reason to chose him as his successor. Active Skills [ ] Sprint/Dash - evolved into Quicksilver : A skill that increases the user's speed by 30% using 1 mana each minute. Upon evolving to Quicksilver, it increases Jinwoo's speed even further, to the point that not even high-ranking hunters were able to track him. Jinwoo uses Murderous Intent/Bloodlust on Kang Taeshik . Bloodlust / Murderous Intent (in the anime): It allows Jinwoo to intimidates his opponents using strong energy for one minute, which induces a state of fear, reducing their stats by 50%. Stealth: A skill that allows him to remain hidden with his surroundings, hiding his presence and mana. Nevertheless, it can be broken by certain magic beasts, such as the mages that Jinwoo faced in the Job-Change Quest Dungeon. Jinwoo's camouflage can however be broken by mages Jinwoo draws back his dagger. Dagger Throw - evolved into Dagger Rush : A skill that allows him to toss his daggers at his opponent, having learned Ruler's Authority, he can use all the daggers he has to remotely throw his daggers at an immensely high speed at his target with high precision and he can even draw back his daggers. When evolved into Dagger Rush, the skill allows him to throw several daggers at once in multiple directions. Jinwoo explaining his Shadow Exchange skill. Critical Attack / Fatal Strike (in the anime) - evolved into Mutilation : A skill that allows him to aim his daggers at his opponent vital spot. Body Aging Manipulation : Following the end of the main series, in the sequel, Jinwoo is capable of altering his appearance based on his age. He can be shown to transform himself into a child, his 16 year-old appearance, as well as an older version of his appearance, as Jinwoo is practically immortal, as he no longers ages naturally. Shadow Monarch Powers [ ] “ Arise. „ ~ Jinwoo's command word to extract the shadow of living being/reviving it as his minion. As he obtain the hidden class necromancer, he was instantly promoted of being the \"Shadow Monarch\", initially presumed as sub-type of a mage, in actuality, it is a position of becoming an cosmic ruler of the dead by inheriting the legacy of his predecessor through the System, Ashborn, with both the powers of a Monarch and Ruler. Shadow Extraction: By speaking the word \" Arise \", Jinwoo can extract the shadows or revive his enemies he has defeated as long as life does not exist within them, instead using their residual mana as a source. Umbrakinesis: Jinwoo can create layers of armor and constructs using shadows. Astralization: Jinwoo can transform himself to a giant that resembles Ashborn. Shadow Save: Jinwoo can store the shadows that he has turned into his soldiers inside of his own shadow and recall them when needed. Shadow Exchange: Jinwoo can switch places with whatever shadow he has summoned and sent to another location without a distance limit. Shadow Preservation : An exclusive skill for the Shadow Monarch, Jinwoo can call back his shadow soldiers. Monarch's Domain: An area-effect ability, which increases the powers of his Shadows, replacing the colors of those Knight Grade Shadows from Blue-Black to Purple-Black. Ruler's Authority: A power common among Rulers, due to his predecessor Ashborn also being a Monarch, Jinwoo is granting power akin to psychokinesis, letting him control physical items without actual contact. Jinwoo seems to have acquired the power during the Job-Change Quest Arc. Dragon's Fear : A common skill for the Dragon Monarch and his minions that Jinwoo also has access to. It allows him to release a immensely powerful mana-infused scream to its surrounding, bringing down anyone weaker than the user to their knee. Equipments [ ] Weapons Cloths and Accessories Miscellaneous Appearance Name Description Rarity Type Attacks and Effects N/A Kasaka's Venom Fang Made from Kasaka's venomous fangs. C-Rank Dagger Attack +25 Paralyze and Bleed effects Jinwoo wields the Knight Killer Jinwoo buys the Knight Killer in the System's shop 1/2 Knight Killer Designed to damage armored enemies. As the name suggests, it makes its wielder to kill knights much easier, greatly contributing during his battle within the Job-Change Quest Dungeon. B-Rank Dagger Attack +75 Extra 75% damages it given to armored enemies Baruka 's Dagger Once owned by the Ice Elf chef Baruka until he was killed by Jinwoo. A-Rank Dagger Attack +110 Agility +10 Demon King's Daggers Belonged to the Monarch of White Flames Baran before killed by Jinwoo. S-Rank Dagger Attack +220 \"Two as One\" effect: provides bonus attack dealt on each dagger depending on its owner's strength. Jinwoo with the Demon King's Longsword. 1/2 Demon King's Longsword Belonged to the Monarch of White Flames Baran before killed by Jinwoo. S-Rank Longsword Attack +350 \"Storm of White Flames\" effect: Summons a targeted small area covered by a light storm. Kamish 's Wrath A pair of daggers that are specifically made from the dragon Kamish's fangs. Jinwoo received them from Thomas Andre following his triumph aginst him. ??? Dagger Attack +1500 Mana-sensitive weapons, it can line up to its owner's physical strength as well as having its mass being altered at will. Appearance Name Rarity Type Effects Gatekeeper's Necklace (novel)/Warden’s Necklace (manhwa) A-Rank Necklace Agility +20 Sense +20 High Knight’s Chestplate B-Rank Armor Physical damage reducement +7% If the user's strength is under 80, his movement is decreased. High Knight’s Gauntlet B-Rank Armor Physical damage reducement +3% Hand protection from injuries.\nIf the user's strength is under 80, his movement is decreased. Assassin's Shoes B-Rank N/A Attack +220 \"Two as One\" effect: provides bonus attack dealt on each dagger depending on its owner's strength. Archer’s Gloves C-Rank N/A N/A Image N/A High Magician’s Ring B-Rank N/A Red Knight ’s Helmet S-Rank Armor Physical damage reducement 15% Strength +20\nStamina +20 Warm Fur Coat None Junk Warm Gloves Demon Monarch's Earring S-Rank Accessory Strength +20 Vitality +20 Demon Monarch's Necklace S-Rank Accessory Agility +20 Intelligence +20 Demon Monarch's Ring S-Rank Accessory Perception +20 Intelligence +20 TBA Relationships [ ] Family [ ] Sung Il-Hwan : Jinwoo's father, who was a hunter, vanished a long time ago, much before he himself became a hunter. It was later revealed that he was trapped inside a dungeon and only escape thanks to the Rulers and became one of their vessels. The father and son finally met during the final battle against the Monarchs, where II-Hwan decided to sacrifice himself before seeing his son one last time. Park Kyung-Hye : Jinwoo cares deeply about his mother as after falling into a rare disease called Eternal Sleep. He decided to become a Hunter to pay for the hospital fees despite ended up near dead the sometimes. After he discovered the possible creation of the Holy Water of Life at the Demon Castle, he didn't hesitate to do whatever it took to create the item to awake his mother. Sung Jinah : Jinwoo and Jinah have the typical brother-sister relationship, both caring about one another, while sometimes arguing with one another. She is another reason he decided to become a Hunter as he needed to also support her since she was still attending high school. As a true testament to his love for her younger sister, Jinwoo broke from his usual calm demeanor after seeing the bruises left behind by the High Orc Leader on his face, leaving Igris to protect and evacuate her and the other students before slaughtering all the remaining High Orcs in the most brutal manner possible compared to all the other monsters he's fought. Cha Hae-In : S-Rank and Vice Guild Master of Hunters Guild, and his eventual love interest-then-wife. At first he respects her of being a high level hunter, intrigued of her ability of her mana smell, as he first interacted with her as a miner When he first met her, he unknowingly piqued her interest of him due to his scent is not fouled like the other hunters, surprising her with his strength, and saving her from being killed by the Ant King, resulting of developing romantic feelings for him. She is also the first one of attempting to join his guild, along with volunteering of saving Jinwoo from the Double Dungeon despite her being outmatched by the Architect, when she announced of her relationship to Jinwoo by the Architect who questioned her about, unaware that Jinwoo heard her conversation with the Architect. Eventually, Jinwoo became more aware of her feelings, as he asked her on a date. His feelings for her is so strong that his plan in the revised timeline is to reunite with her after fighting the Monarchs for 27 years, which he promised to her before his fight with Antares, which succeeds, as he plan to join the track-and-field team to naturally meet her, as time past, Jinwoo  married her, eventually leading the birth of their offspring, Suho. Sung Suho Hunters [ ] Go Gunhee : Jinwoo has great respect for Gun-Hee because of his status and kindness, being one of the only people to assist in different ways after being evaluated as an S-Rank. In comparison to the other Hunters aside from Yoo Jin-Ho and Cha Hae-In, Gun-Hee is one of the only people who Jinwoo is noted to have serious and casual conversations on a daily basis. Yoo Jinho : Sung Jinwoo's subordinate and Vice Guild master to the Ahjin guild. Jinwoo cares deeply for him, as Jinho protected him despite being weaker, he lets him treated like a younger brother, which Jinho's brother was more colder, making them inseparable. Their bond is so powerful that when Jinho being kidnapped and tortured by Hwang Dongsu, Jinho refused to tell where Jinwoo is, in return, an enraged Jinwoo came to the rescue, easily beats down Dongsoo for torturing his best friend, which led him killing Hwang and utterly defeated Thomas Andre, the strongest National Level hunter and Dongsoo's boss. In the aftermath, every people became very fearful of Jinwoo due to his victory against Thomas just for Jinho. Recruited Major Shadows [ ] Jinwoo has a rather odd relationship with all his shadows, they maintain their personalities while also being loyal to Jinwoo. he often refers to them as idiots, but nevertheless grateful for their devotion while respecting their capabilities. Igris : The shadow of Blood-Red Commander Iris and the first major one recruited by Jinwoo. Among his servants aside from Beru, Igris arguably the most notably loyal to his current King, acting as a knight should in front of a king. During a previous dungeon raid in an S-Rank Dungeon, he once collected the heads of the monsters he defeated and presented them to Jinwoo in an attempt to display his loyalty, but he told him to stop since Iron was copying the same thing, albeit with a monster Jinwoo defeated instead. Tank : An Ice Bear mini boss, being the rank of Elite originally, he later upgrades to the rank of knight. He is named tank because he charged through many demons in the demon tower arc. Greed : The shadow of Hwang Dongsoo , a former S-Rank hunter who Jinwoo killed. Beru : The shadow of the murderous boss of Jeju Island, the Ant King . He remained as Jinwoo's strongest shadow until Bellion joined the army, who easily defeated him. Min Byung-Gyu (Briefly): A hunter who was killed by the Ant King before getting revived by Jinwoo. However, he was convinced by Byung-Gyu's ally, Baek Yoonho to let him rest as he already retired as a hunter before dying at the hand of the Ant King. He is also one who informed Hae-In to let Jinwoo aware of his powers, which Jinwoo recognized as a clue to his investigation of the System. Kamish (Briefly): Once a servant of the Dragon Monarch , Kamish was the boss for the first ever opened dungeon gate on Earth. Following his destruction and defeat agains the five national level hunter, his corpse was revived by Jinwoo eight years later as a shadow soldier. However, because Kamish's soul was too damaged and eight years have passed since his death, Kamish could only sustain temporarily as a shadow soldier. Before his permanent passing and fading away forever, Kamish notifies Jinwoo that four hunters have possession of powers granted by the rulers and to be cautious of them. Igris, the shadow of Blood-Red Commander Iris. Beru, the shadow of the Ant King . Tank, the shadow of an ice bear that Jinwoo killed in a Red Gate. Iron, the shadow of a Kim Chul, an A-Rank hunter who was killed by Jinwoo. Tusk , the shadow of Kargalgan , Boss of the Hunters Guild Gate who Jinwoo easily defeated. Bellion the strongest shadow to ever exist and previously served Ashborn . 1/6 Iron : The shadow of Kim Chul. Iron has inherited most of his original's personality, he is noted to have over-killed enemies that were already defeated. Jinwoo had to reprimand him often. He can find Iron's acts irritating at times, mostly because he sometimes copies what Igris does in showing his loyal to Jinwoo to the point of being almost the comic relief among all the shadows. The most lethal and loyal shadow Jinwoo has, being the rank of general and having the speed and power to kill S-ranks easily. Tusk : Initially known as Kargalgan , a high orc magician boss with the rank of Elite Knight, with the power of Hymns he can control fire magic, gravity magic, barriers, explosive magic and acceleration and deceleration magic. Kaisel : Jima : Bellion : The strongest shadow to ever exist who previously served Ashborn, the original Shadow Monarch, before joining Jinwoo's army and merging the original Shadow Army with his, after his his victory against the Frost Monarch. Quotes [ ] “ I won't be solo leveling anymore! „ ~ Jinwoo upon realizing that he no longer as to fight alone now that he obtained necromancy; ironically mentioning the series' name, in Episode 12 of the anime. Trivia [ ] During the second episode of the anime, Jinwoo's Japanese voice actor took so much effort in screaming that he began to cough blood when Jinwoo was being tortured by the statues in the Double Dungeon. In Episode 8 of the anime, the final level shown when he was thinking ahead in his process of leveling up with the system is level 146, the last level that Jinwoo will reach much later on in the story before he is revived as the new Shadow Monarch. In other words, this serves as a foreshadow. Both Jinwoo's voice before and after his reawakening were voiced by Aleks Le in the English dub, as he was skilled enough to gradually alter his voice deeper as Jinwoo leveled up. Aleks Le has jokingly threatened to change Jinwoo's iconic line in the series from \"Arise\" to either \"Wakey wakey\", \"Wake Up\", \"Get up Buddy\", \"Erect\", or \"It's time for school\" to the countless of those who commented comments threatening to not mess up the Arise line, specifically when he revived Igris. Because of how the System was solely designed for its user and Ashborn alone, only Jinwoo, the Kandiaru/Architect, and Ashborn knew the program's existence. Not even the Monarchs nor Rulers knew that Jinwoo possessed such ability by his side. It was revealed that in Ragnarok, as he impregnant Hae-In, his son's powers were so powerful that it increase his wife's mana capacity, reaching on the same strength as a National Level Hunter. External Links [ ] Sung Jinwoo on the Solo Leveling Wiki Sung Jinwoo on the Solo Leveling: ARISE Wiki Sung Jin-Woo on the All Fiction Battles Wiki Sung Jin-Woo on the Top-Strongest Wikia Wiki See Also [ ] The System on the Solo Leveling Wiki Quests on the Solo Leveling Wiki Courage of the Weak on the Solo Leveling Wiki The Preparation To Become Powerful on the Solo Leveling Wiki Kill the Enemies on the Solo Leveling Wiki Job Change Quest on the Solo Leveling Wiki Penalty Quest on the Solo Leveling Wiki Navigation [ ] Heroes Rulers Ashborn Shadow Soldiers Bellion | Beru | Igris Korean Hunters Association Go Gunhee | Woo Jinchul Double Dungeon Raiding Team Sung Jinwoo | Song Chi-Yul | Lee Joohee | Park Gi-Sool Nationa Level Hunters Thomas Andre | Liu Zhigang | Siddharth Bachchan Hunters Guild Choi Jong-In | Cha Hae-In | Son Kihoon | Gina White Tiger Guild Baek Yoonho | Park Heejin | Baek Miho Ahjin Guild Sung Jinwoo | Yoo Jinho | Yoo Soohyun Jeju Island Squad Korean Team: Cha Hae-In | Baek Yoonho | Lim Tae-Gyu | Min Byung-Gyu | Eunseok | Ma Dongwook Japanese Team: Kanae Tawata | Goto Ryuji | Akari Shimizu Others Sung Il-Hwan | Norma Selner | Sung Jinha | Han Song-Yi | Yoo Myunghan Sung Suho's Team Sung Suho | Beru | Gray | Esil Radiru Hunter Origin Series Alicia Blanche's Story : Alicia Blanche | Matteo Blanche Charlotte and Harper's Story : Charlotte and Harper | Sister Millie Amamiya Mirei's Story : Amamiya Mirei Han Se-Mi's Story : Han Se-Mi Isla Wright's Story : Isla Wright Categories Categories : Spoilers Mature Solo Leveling Heroes Male Webcomic Heroes Book Heroes Strong-Willed Fighters Assassins One-Man Army Warriors Chopsocky Heroes Revived Rescuers Lethal Loyal Wealthy Fortune Hunters Big Good The Messiah Force of Nature The Chosen One Determinators Famous Successful Protectors Protectors of Innocence Successors Adventurers Thrill-Seekers Summoners Monster Slayers The Hero Magic Siblings Power Hungry Arrogant Dreaded Wrathful Titular Honest Neutral Good Mercenaries Truth-Seekers Tricksters Pragmatists Virtually Resourceful Dimension Travelers Leaders Officials Businessmen Provokers Monarchs Paranormal Master Orator Masterminds Wayward Heroes Manhwa Heroes Anime Heroes TV Show Heroes Parents Casanova Superheroes Elementals Creators Good Vs. Good Localized Protection Immortals Victims Action Heroes Berserkers Global Protection Anti-Heroes Possessed/Brainwashed Philanthropists Honorable Legacy Hope Bringers Bond Protectors Cosmic Entity Rogues Movie Heroes Crossover Heroes Cosmic Protection Animal Kindness Insecure Brutes Freedom Fighters Master of a Villain Tragic Scapegoat Languages Français Italiano Polski Community content is available under CC-BY-SA unless otherwise noted. More Fandoms Fantasy Sci-fi Advertisement Explore properties Fandom Muthead Fanatical Follow Us Overview What is Fandom? About Careers Press Contact Terms of Use Privacy Policy Digital Services Act Global Sitemap Local Sitemap Community Community Central Support Help Advertise Media Kit Contact Fandom Apps Take your favorite fandoms with you and never miss a beat. Heroes Wiki is a FANDOM TV Community. View Mobile Site Follow on IG TikTok Join Fan Lab"
  },
  "https://screenrant.com/solo-leveling-jinwoo-all-abilities-shadow-monarch-powers-explained/": {
    "url": "https://screenrant.com/solo-leveling-jinwoo-all-abilities-shadow-monarch-powers-explained/",
    "content": "All Of Jinwoo's Abilities And Powers In Solo Leveling Explained Screen Rant Menu Sign in now Close Movies Submenu Movie Features Movie News Movie Reviews Movie Lists Movie Trailers TV Submenu TV Features TV News TV Reviews TV Lists Reality TV Submenu Reality TV Features Reality TV News Reality TV Lists Gaming Submenu Game Features Game News Game Guides Game Reviews Game Lists Comics Submenu Comic Features Comic News Comic Reviews Comic Lists Anime Submenu Anime Features Anime News Anime Lists Music Submenu Music Features Music Lists WWE Submenu WWE News WWE Features WWE Lists Videos Threads More Submenu Lists Interviews Podcasts Sign in Newsletter Menu Follow Followed Like More Action Sign in now SR Exclusives SR Database Star Wars Marvel DC Star Trek Best on Streaming Close All Of Jinwoo's Abilities And Powers In Solo Leveling Explained Solo Leveling 364 9.5 /10 Solo Leveling Favorite Watchlist 10 stars 9 stars 8 stars 7 stars 6 stars 5 stars 4 stars 3 stars 2 stars 1 star Review Follow Followed 23 By Merlyn De Souza Published Apr 3, 2024 Follow Followed Like Link copied to clipboard 364 9.5 /10 Solo Leveling Favorite Watchlist 10 stars 9 stars 8 stars 7 stars 6 stars 5 stars 4 stars 3 stars 2 stars 1 star Review Follow Followed 23 Sign in to your ScreenRant account Custom Image by Merlyn De Souza Warning: Contains manhwa spoilers for Solo Leveling. Summary Sung Jinwoo's powers stem from inheriting the title of Shadow Monarch, granting him necromancer abilities. His key skills include Kandiaru's Blessing for vitality, Sprint for speed, and Armor Creation for defense. Job-specific abilities like Shadow Extraction, Preservation, and Monarch's Domain give Jinwoo his powerful shadow army and other handy powers like teleportation. Solo Leveling 's Sung Jinwoo has acquired many powers and abilities since becoming a \"player\" which have allowed him to quickly climb his way to the very top of the hunter ranking system. From being ridiculed as \"Humanity's Weakest Hunter\" Jinwoo has quickly evolved into a hunter of unparalleled strength, stronger than even the fearsome S-rank hunters in Solo Leveling all thanks to his powerful abilities. Despite being disguised through a game-like system, Jinwoo's powers truthfully stem from him inheriting the title of the Shadow Monarch, turning him into a powerful necromancer capable of turning the shadows of his fallen foes into his devout soldiers. As such, Jinwoo's powers and skills can be categorized into one of three categories — job-specific skills which are directly tied to his title or job as the Shadow Monarch, active skills which he consciously uses in battle, and passive skills that grant Jinwoo buffs and immunity. Related Solo Leveling Confirms How Jinwoo's Powers Have Changed Him Forever Sung Jinwoo's arc has only begun yet the latest episode hints his newfound powers may have already changed him and his mentality for good. Posts 16 Kandiaru's Blessing Prevents Any Abnormalities in Status Skill Type: Passive This passive skill ensures that Jinwoo remains strong and healthy throughout his life and is responsible for Jinwoo regrowing his lost limbs after the traumatic battle in the Double Dungeon. The Great Spellcaster Kandiaru's Blessing is the first ever skill Jinwoo obtains upon becoming a player and is activated when Jinwoo proves his courage in the Double Dungeon . This passive skill ensures that Jinwoo remains strong and healthy throughout his life and is responsible for Jinwoo regrowing his lost limbs after the traumatic battle in the Double Dungeon. The official description of the skill in the system states that it ensures Jinwoo's status (or quality of life and health) is immune to any irregularities in status and always maintains equilibrium. Simple as it sounds, this skill encompasses a bunch of very useful buffs.​​​ These include d etoxification of all poisons (including alcohol), immunity to all diseases, and quicker recovery from fatigue and damage . Moreover, if Jinwoo's health points drop below 30% this skill reduces all damage dealt to him by 50% from that point onwards, giving him just the extra hand he needs during the toughest of battles. Thus, Kandiaru's Blessing is a crucial skill that keeps Jinwoo alive. Solo Leveling: Ragnarok , the sequel series to Solo Leveling, reveals that Kandiaru is actually the name of the creator of the system, better known as the Architect. 15 Immortality Allows Jinwoo to Live Forever Young Skill Type: Passive Jinwoo begins gradually adjusting his appearance to appear older as time passes. Though never officially explained, Jinwoo stops aging after he fully inherits the title of the Shadow Monarch from Ashborn and the entirety of his powers, implying that he is no longer completely human after the fact. After using the Cup of Reincarnation one last time towards the end of Solo Leveling , Jinwoo spends nearly three decades fighting the other Monarchs in the dimensional crack but returns looking about the same age as he did before he left, even though two years have passed on Earth. After this, Jinwoo begins gradually adjusting his appearance to appear older as time passes. 14 Stealth allows Jinwoo to Conceal His Presence Skill Type: Active Jinwoo obtains the skill from a rune stone after killing Kang Taeshik, which becomes quite a useful part of his arsenal. The Stealth skill is first introduced through Kang Taeshik, a corrupt hunter from the Korean Hunters Association who uses the skill to commit crimes inside dungeons covertly. Jinwoo obtains the skill from a rune stone after killing Kang Taeshik, which becomes quite a useful part of his arsenal. Stealth is the very first skill Jinwoo gains from someone else and consumes about 10 mana or magic points for every second it is used besides costing 200 mana to activate, making it quite a costly skill to use. The skill is generally used by assassin-type hunters and allows Jinwoo to completely camouflage himself and conceal his presence , making him practically invisible . Due to its dangerous nature, Kang Taeshik kept the fact that he possessed the skill a tight secret, killing anyone who had ever seen him use it. That said, those with heightened perception can still sense his movements, particularly high-ranking mage-type hunters and the magicians during the Job Change Quest. Min Byung-gu, one of Korea's S-rank hunters, can also use a version of the Stealth skill, albeit a relatively weaker one which prevents him from moving while using it. 13 Sprint Allows Jinwoo to Briefly Increase His Movement Speed Skill Type: Active As the name implies, the Sprint skill allows Jinwoo to temporarily boost his movement speed by 30% and is notably used during his battle against Kang Taeshik, helping him match the assassin's breakneck speed. Jinwoo first uses the skill against the spider boss beast when he is trapped in the boss' lair along with Yoo Jinho. The Sprint skill consumes 1 mana per minute, making it quite handy in battle. Also known as Dash, this skill levels up as Jinwoo grows stronger and eventually upgrades to Quicksilver. 12 Commander's Touch Evolves into Ruler's Authority Skill Type: Active Close Commander's Touch is the skill first seen used by Red Knight Igris and allows the user to telekinetically control objects . Jinwoo obtains this skill from a rune stone much like Stealth, after defeating Igris during the Job Change quest. But, he is unable to use it on the same level as Igris until a little later in the series, once he has leveled up more. Despite initially being limited to small objects, Jinwoo later uses the skill in full, sometimes in creative ways, such as to propel himself to increase the speed of his movements and attacks. This skill later evolves into Ruler's Authority, which allows its user to control even people . Like the name suggests, Ruler's Authority is a skill unique to the Rulers and their vessels on earth, including Jinwoo, as the Shadow Monarch from Jinwoo gets his powers from was formerly a Ruler. This skill is even dubbed Capture when used by Thomas Andre, a National Level Hunter from America who uses it to draw his opponents towards him. 11 Dagger Toss Negates a Major Close Combat Weakness Skill Type: Active Close Though just as skilled at physical combat, Jinwoo has always favored using daggers, a fact that remains consistent until the very final battle of the series. From Kasaka's Venom Fang, to the Knight Killer and Kamish's Wrath, Jinwoo takes a liking to using daggers very early on and his skill at using them only grows as the series progresses. Jinwoo first gains the Dagger Toss skill during the Job Change Quest after buying the Knight Killer Dagger and uses it against the sneaky magicians in the dungeon. The skill costs 30 mana to use and its damage and accuracy increase as the skill levels up. Jinwoo eventually becomes so proficient at using daggers that this skill upgrades to Dagger Rush, which helps Jinwoo release an entire barrage of attacks from multiple directions. 10 Bloodlust Induces Fear in Opponents Skill Type: Active Also called Murderous Intent in the anime, Jinwoo gains this skill as a reward after completing the emergency quest which forces Jinwoo to kill Hwang Dongsuk and his party . Most notably used against Kang Taeshik, Bloodlust allows Jinwoo to intimidate an opponent and induce fear in them for 1 minute. The skill costs 100 mana per use and can also be used on multiple opponents. When used successfully, it decreases an opponent's stats by a whole 50%, making this skill quite powerful. In fact, the Bloodlust skill is what helps Jinwoo finally finish off Kang Taeshik by paralyzing him with fear. That said, the skill does not take effect on particularly powerful foes who are more confident in themselves. 9 Critical Attack Strikes an Opponent's Vitals Skill Type: Active The Critical Attack skill was first used against a wolf-like magic beast when Jinwoo was raiding C-rank dungeons with Yoo Jinho and, simply put, helps Jinwoo attack an opponent's vitals . The skill consumes 70 mana and can only be used with a dagger, which happens to work out for Jinwoo who happens to like using daggers. The skill eventually upgrades to Mutilate, which was powerful enough to even take down the Ant King during the Jeju Island Raid , a beast powerful enough to kill nearly all of Japan and Korea's S-rank hunters. Mutilate causes significantly more damage and can nearly rip an opponent to shreds with multiple rapid slashes. 8 Advanced Dagger Arts Makes the Most of Jinwoo's Preferred Weapon in Battle Skill Type: Passive Introduced along with the Critical Strike skill during the C-rank dungeon raid, Jinwoo unlocks Advanced Dagger Arts because of his heavy use of daggers. The skill improves Jinwoo's proficiency at using daggers and increases the damage dealt when using a dagger by 33% . As a passive skill, Advanced Dagger Arts does not consume any mana and is a very fitting skill for Jinwoo. The skill is also a match made in heaven with the Critical Strike skill. The added damage from the skill is immediately visible when Jinwoo stabs a wolf-like magic beast leaving three gaping holes through its chest. The skill is also a match made in heaven with the Critical Strike skill, together allowing Jinwoo to strike accurately and with added power at an opponent's weakest points. 7 Dragon's Fear Invokes Pure Despair Skill Type: Active Much like the Bloodlust skill, Dragon's Fear is another powerful skill that can incapacitate opponents and is perhaps one of the most powerful skills of its kind in the verse. This skill is exclusive to Anatares, the Monarch of Destructions, and his subjects, but Jinwoo manages to obtain this skill from Kamish's rune stone and ironically uses it during the final war against Antares and the other Monarchs. Dragon's Fear allows Jinwoo to release a powerful scream infused with mana that strikes panic and despair in all those weaker than him in the vicinity. These effects apply to allies and opponents alike and the skill is unable to target only a specific enemy, which is why Jinwoo sends away his shadows before using the skill in the final war. Kamish was a massive dragon that spawned from the first S-rank gate in Solo Leveling and is dubbed \"humanity's greatest calamity.\" 6 Memory Manipulation Plays a Crucial Role in the Epilogue Skill Type: Active In the epilogue of Solo Leveling , another surprising skill is added to Jinwoo's arsenal which is the ability to manipulate memories. Jinwoo can not only alter and erase another's memories, but he can also allow them to look into his memories and restore their memories of the original timeline. Jinwoo also restores Go Gun-hee's memories of the alternate timeline in the epilogue just before his death. Jinwoo uses this skill mainly to restore connections and relationships with a few of the people closest to him, like Woo Jinchul and Cha Haein. Jinwoo also restores Go Gun-hee's memories of the alternate timeline in the epilogue just before his death. Seeing as one of the Rulers was able to erase Jinwoo's father's memories of the old timeline as well, this skill may be one commonly possessed by all Rulers. 5 Armor Creation Skill Type: Active In the final battle against Antares, Jinwoo discovers another surprising power of the Shadow Monarch when he finds he can create armor made of shadows for himself. Jinwoo's fully armored form is quite enormous and greatly resembles Ashborn's appearance, with similar long, flame-like purple hair floating up behind him. Antares even momentarily mistakes it for the Spiritual Body Manifestation ability used exclusively by the vessels of the Rulers and the Monarchs. This skill is also quite similar to one of Thomas Andre's, a National Level Hunter who can similarly create and coat himself with gold armor suggesting it may not be a skill unique to the Shadow Monarch alone. Related 10 Strongest Solo Leveling Hunters Apart from Sung Jin-Woo, Solo Leveling has introduced some powerful Hunters from around the world. Posts 4 Shadow Extraction Draws out the Shadows of the Fallen Skill Type: Job-Specific Shadow Extraction forms the very basis of Jinwoo's powers as the Shadow Monarch by allowing him to extract the shadows of the dead, which can be later added to his army of shadow soldiers. The skill is activated using a specific keyword or phrase that Jinwoo designates after completing the Job Change Quest, selecting \" Arise \" as his keyword of choice. Shadow Extraction has no limit on how many shadows can be extracted at once and the ability can be used on multiple targets at once even across a large area. The skill works by extracting a target's mana, which is why the skill cannot be used on regular humans who have not awakened as hunters or on demons as they have contaminated mana. The skill does not work on the Rulers or the Monarchs and Jinwoo cannot extract the shadow of a target who was much stronger than him either. Unlike many of Jinwoo's other skills, Shadow Extraction does not cost mana to use, but Jinwoo only gets three attempts to successfully extract a target's shadow, after which the shadow returns to nothingness and cannot be extracted again. Whether a target's shadow can be extracted depends on the target's stats and how much time has passed since the target's death. The stronger a target is and the longer it's been since its death, the higher the chances of failure. Thus, Jinwoo was unable to extract Kamish's shadow because too much time had passed since the beast had been defeated. 3 Shadow Preservation Builds Jinwoo's Shadow Army Skill Type: Job-Specific While Shadow Extraction extracts the shadows, it is Shadow Preservation that truly allows Jinwoo to make them a part of his army. Jinwoo can summon a particular shadow soldier again and again as he chooses only once the shadow has been \"saved.\" All of these shadows are stored in Jinwoo's own shadow and can be detected only by the most perceptive hunters. Shadow Preservation also requires no mana to use but dies initially come with a limit to how many shadows Jinwoo can store which is gradually opened up as he levels up. Once the skill reaches level 2, Jinwoo unlocks a special effect that allows him to share senses with his preserved shadows. Jinwoo primarily uses this effect to keep an eye on multiple people at once by assigning his shadows to watch over them or hide in their shadows. 2 Monarch's Domain Buffs the Shadow Army's Stats Skill Type: Job-Specific As if Jinwoo's shadow soldiers weren't strong enough already, this job-specific skill makes them even more powerful when fighting in close vicinity to him. Simply put, Monarch's Domain offers a 50% stat increase to Jinwoo's shadow soldiers when fighting in his shadow . This skill also does not consume any mana and allows Jinwoo to extend his shadow around him in a wide circle. Jinwoo obtains the skill after reaching Level 70 while making his way through the floors of the Demon Castle and first uses it against Kargalgan, while on the raid with the hunters from the White Tiger Guild. Kargalgan is eventually defeated by Jinwoo and is turned into one of his most powerful shadows named Tusk. 1 Shadow Exchange Skill Type: Job-Specific Like the name suggests, this skill allows Jinwoo to swap places with his shadows. Jinwoo obtains this skill from a runestone which he receives as a reward after completing the Demon Castle quest. While the skill does not consume any mana, it does initially come with a cool-down period of 3 hours which gradually decreases as the skill level increases. Jinwoo most notably uses this skill to teleport to Jeju Island during the raid, which makes for one of the most exciting uses of the skill in the series. This skill can be used to t eleport across the world in mere seconds and essentially uses shadows as a portal. Jinwoo later discovers he can use Shadow Exchange to teleport not just himself but also other people along with him, which comes into play during the final battle against Antares. After Jinwoo awakens the full power of the Shadow Monarch, the cooldown period is lifted and Jinwoo no longer requires a shadow soldier to be stationed to switch places with, but can simply teleport anywhere as he pleases. Solo Leveling is available from Crunchyroll. Watch on Crunchyroll Like Follow Followed Solo Leveling TV-MA Action Adventure Animation Fantasy 364 9.5 /10 Release Date January 7, 2024 Directors Shunsuke Nakashige Writers Noboru Kimura Cast See All Taito Ban Shun Mizushino (voice) Genta Nakamura Kenta Morobishi (voice) Where to watch Close WHERE TO WATCH Streaming Based on a webtoon series, Solo Leveling is an action-adventure fantasy anime originally created by Chugong. When Sung Jinwoo is slain in the depths of a high-level dungeon, he is reborn - but this time with a plan. Utilizing a unique program that only he can, Jinwoo levels up remarkably fast - and he intends to use his newfound strength to reach the heart of the dungeon and uncover its secrets. Creator(s) Chugong Powered by Expand Collapse Anime Solo Leveling Follow Followed Like Share Facebook X LinkedIn Reddit Flipboard Copy link Email Close Popular A Manhwa Considered Solo Leveling's Successor Has Already Surpassed It In the US Solo Leveling According to the top webtoon app in the U.S., Tapas, Solo Leveling's manhwa has been surpassed as the most successful title on the platform. Posts 34 By Vanessa Piña Oct 18, 2024 I've Read Solo Leveling's TRUE Successor and It's So Good, It's Not Even Close Posts 21 By J.R. Waugh Sep 1, 2024 Solo Leveling's Season 2 Finale Changed a Special Scene, & Honestly? It Was For the Best Posts By Joshua Fox 12 hours ago How Many Seasons Will Solo Leveling Need to Adapt the Manhwa? More Than You Think Posts By Vanessa Piña 23 hours ago Solo Leveling Is Great, But These 8 New-Gen Anime Are Just as Good Posts By Hannah Diffey 5 hours ago Solo Leveling Season 2 Just Censored One of Jinwoo Darkest Scenes From the Manhwa Posts 22 By Vanessa Piña Jan 12, 2025 Recommended After John Boyega's Latest Comments, I'm Pretty Much Giving Up On Seeing Finn In Star Wars' New Jedi Order Movie Finn Finn is one of my favorite Star Wars characters, but after John Boyega's recent interview, I'm convinced he's never returning to Star Wars. Posts 4 hours ago Andie MacDowell's 10 Best Movies And TV Shows Movies Andie MacDowell has had a spectacular career that's still going strong, as reflected in her best movies and TV shows. Posts 2 hours ago Sentry's Live-Action MCU Costume Revealed After Thunderbolts* Trailers Hid \"Bob's Hero Look\" Thunderbolts Sentry's full MCU costume from Thunderbolts* is officially revealed by Hasbro in the form of Robert Reynolds' Marvel Legends action figure. Posts 3 hours ago The White Lotus Season 3 Finale Runtime Sets Series Record The White Lotus The White Lotus season 3 is wrapping up the storylines with the longest episode in the HBO series' history, as time in Thailand comes to an end. Posts 2 hours ago After Rewatching Naruto, I Finally Know Why the Anime's Final Arc Feels So Wrong Naruto: Shippuden Naruto is one of my favorite anime series of all time, but at the end of 500 episodes, I thought that one character ruined the finale for everyone. Posts 1 hour ago Daredevil Has the Worst Luck, And These 10 Brutal Moments Make That Clear Here are some of Daredevil’s most tragic and brutal moments that prove that Matt Murdock has some of the worst luck in the Marvel Universe. Posts 2 hours ago Trending Now Mobile Suit Gundam Is Going Hollywood, And I Know How Live-Action Can Do the Anime Justice Solo Leveling Season 3 Latest News, Stories, Characters, And Everything We Know So Far Solo Leveling Season 2 Is Great, But Its Censorship Problem Is Becoming Too Big to Ignore Join Our Team Our Audience About Us Press & Events Review Policy Media Coverage Contact Us Follow Us Advertising Careers Terms Privacy Policies ScreenRant is part of the Valnet Publishing Group Copyright © 2025 Valnet Inc."
  },
  "https://solo-leveling.fandom.com/wiki/Sung_Jinwoo/History": {
    "url": "https://solo-leveling.fandom.com/wiki/Sung_Jinwoo/History",
    "content": "Sung Jinwoo/History | Solo Leveling Wiki | Fandom Start a Wiki Sign In Don't have an account? Register Sign In Solo Leveling Wiki Explore Main Page Discuss All Pages Community Interactive Maps Universe Arcs D-Rank Dungeon Arc Reawakening Arc Instant Dungeon Arc Dungeon & Lizards Arc Dungeon & Prisoners Arc Yoo Jinho Raid Party Arc Job Change Arc Red Gate Arc Demon Castle Arc Retesting Rank Arc Dungeons Cartenon Temple Demon Castle Hapjeong Subway Station Job Change Quest Dungeon Penalty Zone Gates Jeju Island S-Rank Gate First S-Rank Gate Tokyo S-Rank Gate Red Gate Incident Hunters Guild Gate Busan Gate Quests Collect Demon Souls! (1) Collect Demon Souls! (2) Courage of the Weak Job Change Quest Kill the Enemies Survival The Preparation To Become Powerful Terminologies Eternal Slumber False Rankers Guilds Mana Crystals Rune Stones Groups Countries China Japan Korea USA Organizations Korean Hunters Association Korean Hunters Auction Federal Bureau of Hunters Japanese Hunters Association Guilds Hunters Guild Fame Guild White Tiger Guild Fiend Guild Knights Guild Ahjin Guild Scavenger Guild Draw Sword Guild Races Humans Adam White Ahn Sangmin Laura Matsumoto Shigeo Norma Selner Park Kyung-Hye Sung Jinah Yoo Myunghan Hunters National Level Hunters Thomas Andre Liu Zhigang Christopher Reed Siddharth Bachchan S-Rank Hunters Sung Jinwoo Cha Hae-In Sung Il-Hwan Go Gunhee Baek Yoonho Choi Jong-In Lim Tae-Gyu Ma Dongwook Min Byung-Gyu A-Rank Hunters Woo Jinchul Kim Chul Lee Minsung Park Jongsoo Jung Yerim Jung Yoontae Yoo Soohyun Hanekawa B-Rank Hunters Kang Taeshik Lee Joohee Park Heejin C-Rank Hunters Cho Kyuhwan Go Myung-Hwan Hwang Dongsuk Lee Chul-Jin Song Chi-Yul Yoon Kijoong D-Rank Hunters Kim Sangshik Park Beom-Shik Yoo Jinho Joo Jae-Hwan Kang Jeongho E-Rank Hunters Han Song-Yi Magic Beasts Kandiaru Ant King Vulcan Baruka Blood-Red Commander Igris Esil Radiru High Orcs Ice Bears Kaisellin Kamish Shadows Beru Greed Igris Iron Kaisel Bellion Jima Tank Tusk Monarchs Antares Ashborn Baran Rakan Sillad Legia Querehsha Yogumunt Tarnak Community Administrators Handy Templates Wiki Rules Sign In Don't have an account? Register Sign In Explore Fan Central Current Advertisement Skip to content Solo Leveling Wiki 523 pages Explore Main Page Discuss All Pages Community Interactive Maps Universe Arcs D-Rank Dungeon Arc Reawakening Arc Instant Dungeon Arc Dungeon & Lizards Arc Dungeon & Prisoners Arc Yoo Jinho Raid Party Arc Job Change Arc Red Gate Arc Demon Castle Arc Retesting Rank Arc Dungeons Cartenon Temple Demon Castle Hapjeong Subway Station Job Change Quest Dungeon Penalty Zone Gates Jeju Island S-Rank Gate First S-Rank Gate Tokyo S-Rank Gate Red Gate Incident Hunters Guild Gate Busan Gate Quests Collect Demon Souls! (1) Collect Demon Souls! (2) Courage of the Weak Job Change Quest Kill the Enemies Survival The Preparation To Become Powerful Terminologies Eternal Slumber False Rankers Guilds Mana Crystals Rune Stones Groups Countries China Japan Korea USA Organizations Korean Hunters Association Korean Hunters Auction Federal Bureau of Hunters Japanese Hunters Association Guilds Hunters Guild Fame Guild White Tiger Guild Fiend Guild Knights Guild Ahjin Guild Scavenger Guild Draw Sword Guild Races Humans Adam White Ahn Sangmin Laura Matsumoto Shigeo Norma Selner Park Kyung-Hye Sung Jinah Yoo Myunghan Hunters National Level Hunters Thomas Andre Liu Zhigang Christopher Reed Siddharth Bachchan S-Rank Hunters Sung Jinwoo Cha Hae-In Sung Il-Hwan Go Gunhee Baek Yoonho Choi Jong-In Lim Tae-Gyu Ma Dongwook Min Byung-Gyu A-Rank Hunters Woo Jinchul Kim Chul Lee Minsung Park Jongsoo Jung Yerim Jung Yoontae Yoo Soohyun Hanekawa B-Rank Hunters Kang Taeshik Lee Joohee Park Heejin C-Rank Hunters Cho Kyuhwan Go Myung-Hwan Hwang Dongsuk Lee Chul-Jin Song Chi-Yul Yoon Kijoong D-Rank Hunters Kim Sangshik Park Beom-Shik Yoo Jinho Joo Jae-Hwan Kang Jeongho E-Rank Hunters Han Song-Yi Magic Beasts Kandiaru Ant King Vulcan Baruka Blood-Red Commander Igris Esil Radiru High Orcs Ice Bears Kaisellin Kamish Shadows Beru Greed Igris Iron Kaisel Bellion Jima Tank Tusk Monarchs Antares Ashborn Baran Rakan Sillad Legia Querehsha Yogumunt Tarnak Community Administrators Handy Templates Wiki Rules in: Incomplete Sung Jinwoo/History < Sung Jinwoo View source History Purge Talk (0) THIS ARTICLE IS INCOMPLETE AND MISSING INFORMATION [YOU CAN HELP THE SOLO LEVELING WIKI BY EXPANDING IT] Overview History Items Relationships Gallery Contents 1 History 1.1 D-Rank Dungeon Arc 1.2 Reawakening Arc 1.3 Instant Dungeon Arc 1.4 Dungeon & Lizards Arc 1.5 Dungeon & Prisoners Arc 1.6 Yoo Jinho Raid Party Arc 1.7 Job Change Arc 1.8 Red Gate Arc 1.9 Demon Castle Arc 1.10 Retesting Rank Arc 1.11 Hunters Guild Gate Arc 1.12 Return to Demon Castle Arc 1.13 Jeju Island Arc 1.14 Recruitment Arc 1.15 Ahjin Guild Arc 1.16 Double Dungeon Arc 1.17 Japan Crisis Arc 1.18 International Guild Conference Arc 1.19 Monarchs War Arc 1.20 Final Battle Arc 1.21 Epilogue 2 References History Jinwoo as an E-Rank Hunter Jinwoo was born 20-25 years before the events of the main storyline to Sung Il-Hwan and Park Kyung-Hye , and had a little sister named Jinah . Ten years prior to the first Double Dungeon Incident, his father was presumed dead when he mysteriously disappeared inside a dungeon during a raid. Six years later, his mother started to develop symptoms of Eternal Slumber and eventually fell into a coma, but not before making her son promise to her that he'd take care of Jinah in her absence. [ 1 ] With both of his parents out of the picture, Jinwoo was forced to take over as the breadwinner of the family and went on to become a hunter. Due to how unusually weak he was, he quickly became a subject of mockery in the Korean hunter community and was given the disdainful nickname of \"The Weakest Hunter of All Mankind.\" [ 2 ] Nevertheless, he persisted and over the next four years, managed to financially support himself, his sister, and his mother even though he nearly died on almost every raid he went on. A major reason why Jinwoo chose to work as a hunter despite the meager pay and high risk of injury was because it came with healthcare benefits that covered his mother's hospital bills. While Jinah didn't approve of his choice to work as a hunter since he was always came home covered in wounds, she was mature enough to understand that he did it to support her and their mother. However, this didn't stop her from worrying about his health and she eventually told Jinwoo that if there was ever a day where he got injured to the point of not being able to work anymore, she would drop out of school and get a job to support their family in his place. [ 3 ] D-Rank Dungeon Arc Jinwoo struggling to survive in the Double Dungeon On what seemed like a normal D-Rank dungeon raid, Jinwoo and the rest of his raid party at the time, including Lee Joohee , Song Chi-Yul , and Kim Sangshik , discovered a second hidden dungeon inside the gate and decided to check it out. Unfortunately, they realized too late that it was a trap and found themselves locked in with no way out. [ 4 ] Although the party was eventually able to satisfy the conditions to get the dungeon doors to open (mostly thanks to Jinwoo's instincts and  intellect), by that point only six of the seventeen hunters who had originally entered the dungeon were still alive, the rest having been brutally killed by the statues inside the dungeon. Realizing that one person had to stay behind for the rest of the party to escape safely, Jinwoo volunteered to be the sacrifice, as he had already lost his right leg. As the statues skewered him with their weapons and threw him around like a rag doll, a strange message suddenly popped up in front of Jinwoo's face, telling him that he completed the requirements for a hidden quest and asked whether he wanted to accept or reject his status as a Player. With no time or options left, Jinwoo accepted, making him the Player of the System and allowing him to survive the Double Dungeon . [ 5 ] Reawakening Arc Jinwoo discovers the System Upon regaining consciousness, Jinwoo discovered that he had been asleep inside a hospital for three days and that all of his injuries had miraculously healed, including his amputated right leg. He also noticed a strange program screen hovering above him and eventually realized that nobody else could see it. Although he initially thought it was some kind of joke and went back to sleep, he quickly learned that it wasn't when he got sent to a penalty dungeon as punishment for not completing the daily quest on time. [ 6 ] As he never wanted to go back to the penalty dungeon again, Jinwoo decided to take the program seriously, which he later learned was called the System, and discovered that it worked almost like a video game, as it gave him rewards every time he completed one of its quests. [ 7 ] He also started to diligently complete the System's daily quest, which granted him stat points, a random lucky box, and a full status recovery every time he fulfilled its requirements. Instant Dungeon Arc Jinwoo goes on his first solo raid After Jinwoo completed quests over the course of several days, the System directed him to an instant dungeon located near a subway station. Although he was initially intimidated by the fact that he had to solo the dungeon and couldn't leave until the dungeon was cleared, Jinwoo persisted and was ultimately able to kill the boss and all the other monsters inside the dungeon all by himself. [ 8 ] Following this, he also started actively working out and investing in his strength stats, which prompted the System's magical effects to kick in and caused him to become much more muscular and masculine over the course of only a few weeks. [ 9 ] Dungeon & Lizards Arc Jinwoo kills Hwang Dongsuk Despite having grown to the level of a B-Rank thanks to his training with the System, Jinwoo quickly realized that his funds were low due to having not participated in a raid since the Double Dungeon Incident. Seeking to make some money fast, he joined a C-Rank strike squad led by Hwang Dongsuk as their porter, where he also met a wealthy rookie D-Rank named Yoo Jinho . Although the raid initially proceeded without incident, Jinwoo eventually deduced that something was off with the rest of the squad, not including Jinho, and ultimately realized that they were a band of lizards when they trapped both him and Jinho inside the boss room. [ 10 ] Although Jinwoo was able to kill the boss, Hwang and his mates quickly returned and attempted to kill both him and Jinho so that they could hog all the raid profits to themselves. In response, the System gave him a quest to kill Hwang and his men, and Jinwoo followed through, easily slaughtering them all with his dagger. [ 11 ] Dungeon & Prisoners Arc Jinwoo and Jinho talk business About a day later, Jinwoo received a call from Jinho and the two met up at a local coffee shop, where Jinho thanked him for saving his life and asked him if they could form a strike squad together. Although Jinwoo initially refused, he changed his mind when Jinho explained that it would only be temporary and the two of them eventually struck a deal; Jinwoo would help Jinho finish 19 more raids so that he could become a guild master. In exchange, Jinho would keep Jinwoo's true strength a secret and give him a building worth 30B won (26M USD) once all 19 raids were complete. [ 12 ] Deciding to test himself out before he started going on raids with Jinho, Jinwoo entered a S-Rank instant dungeon called the Demon Castle and was almost immediately confronted by Cerberus , the dungeon's first boss. Although Jinwoo was able to kill Cerberus, he nearly died doing so and only won because of his Status Recovery skill. Realizing that it was suicide to venture any further into the dungeon, Jinwoo decided to return when he was stronger. [ 13 ] Yoo Jinho Raid Party Arc Coming soon! Job Change Arc Coming soon! Red Gate Arc Coming soon! Demon Castle Arc Coming soon! Retesting Rank Arc Coming soon! Hunters Guild Gate Arc Coming soon! Return to Demon Castle Arc Coming soon! Jeju Island Arc Coming soon! Recruitment Arc Coming soon! Ahjin Guild Arc Coming soon! Double Dungeon Arc Coming soon! Japan Crisis Arc Coming soon! International Guild Conference Arc Coming soon! Monarchs War Arc Coming soon! Final Battle Arc Coming soon! Epilogue Coming soon! References ↑ Solo Leveling Webtoon : Chapter 89 ↑ Solo Leveling Webtoon : Chapter 1 ↑ Solo Leveling Webtoon : Chapter 10 ↑ Solo Leveling Webtoon : Chapter 3 ↑ Solo Leveling Webtoon : Chapter 10 ↑ Solo Leveling Webtoon : Chapter 11 ↑ Solo Leveling Webtoon : Chapter 12 ↑ Solo Leveling Webtoon : Chapter 16 ↑ Solo Leveling Webtoon : Chapter 18 ↑ Solo Leveling Webtoon : Chapter 20 ↑ Solo Leveling Webtoon : Chapter 24 ↑ Solo Leveling Webtoon : Chapter 26 ↑ Solo Leveling Webtoon : Chapter 27 Categories Categories : Incomplete Community content is available under CC-BY-SA unless otherwise noted. More Fandoms Fantasy Advertisement Explore properties Fandom Muthead Fanatical Follow Us Overview What is Fandom? About Careers Press Contact Terms of Use Privacy Policy Digital Services Act Global Sitemap Local Sitemap Community Community Central Support Help Advertise Media Kit Contact Fandom Apps Take your favorite fandoms with you and never miss a beat. Solo Leveling Wiki is a FANDOM Anime Community. View Mobile Site Follow on IG TikTok Join Fan Lab"
  },
  "https://gamerant.com/how-sung-jin-woo-could-have-prevented-the-jeju-massacre-explained/": {
    "url": "https://gamerant.com/how-sung-jin-woo-could-have-prevented-the-jeju-massacre-explained/",
    "content": "How Sung Jin-Woo Could Have Prevented The Jeju Massacre, Explained Game Rant Menu Sign in now Close Game News Platforms Submenu PlayStation Xbox Nintendo PC Games Mobile GR Originals Submenu Editorials Game Reviews Explainer Game Rant Advance Game Guides Submenu Kingdom Come Deliverance 2 Infinity Nikki Baldur's Gate 3 Zelda: Tears of the Kingdom Honkai: Star Rail Videos Submenu Original Series Game Trailers Threads More Submenu Movies & TV Anime Lists Giveaways Sign in Newsletter Menu Follow Followed Like Threads More Action Sign in now Atomfall (Game Rant Advance) InZOI First Berserker Assassin's Creed Shadows Monster Hunter Wilds Coming Soon Close How Sung Jin-Woo Could Have Prevented The Jeju Massacre, Explained By Oluwatokiloba Folami Published 5 hours ago Follow Followed Like Thread Link copied to clipboard Anime Related Solo Leveling: 8 Characters Who Will Likely Debut In Season 3 Demon Slayer: Best Episode In Each Arc, Ranked Best Anime With Overpowered Main Characters, Ranked Sign in to your Game Rant account Summary The Fourth Jeju Raid was a success despite initial hunter losses, thanks to Sung Jin-Woo's last-minute intervention. Sung Jin-Woo chose family over immediate intervention, trusting fellow hunters' capability in the mission. Sung Jin-Woo's delayed entry exposed Japan's hidden agenda to sacrifice Korean hunters, foiling their plans. Quick Links The Jeju Island Raid Korea’s Final Attempt Why Did Sung Jin-Woo Not Join The Raid Earlier? Placing Family First And Trust In Fellow Hunters Shadow Limitations And Broadcast Delay How Sung Jin-Woo Could Have Prevented The Massacre Deploying Stronger Shadows The Significance Of Sung Jin-Woo’s Actions Exposing Japan’s Hidden Agenda The Jeju Island Raid in Solo Leveling has been one of the most pivotal events in the series , delivering intense action and impressive coordination from the hunters who volunteered for the mission, as well as Sung Jin-Woo, the savior of the day. Although Sung Jin-Woo’s contribution to the raid was immense, several hunters were slain by the ants before he decided to intervene, a decision that fans question. While some simply boil it down to “aura-farming,” others wonder if Jinwoo’s reasons are tied to the deeper parts of the Solo Leveling world and how, considering several hypotheses, he could have prevented the loss of several hunters. Related Solo Leveling: 8 Characters Who Will Likely Debut In Season 3 Solo Leveling's third installment will likely introduce these new characters to the popular anime. Posts 1 The Jeju Island Raid Korea’s Final Attempt Close While gates are a common occurrence in the Solo Leveling world, S-Rank gates are few and far between , and the one that appeared on Jeju Island in Korea was terrifying, to say the least. After three unsuccessful attempts, the loss of several hunters and civilians, and an evolved species of ants threatening to cause chaos outside the island, a fourth raid was carried out. Despite the loss of several hunters, the raid was a success, thanks to Sung Jin-Woo’s last-minute intervention. The Raid Team itself was very efficient and would have cleared the gate without the help of Sung Jin-Woo if the Ant King had not appeared. They had already made solid progress with proper coordination and action, achieving their original goal of defeating the Ant Queen. However, with the appearance of the Ant King and Sung Jin-Woo, it went from a simple raid mission to an all-out brawl between anomalies, a brawl Sung Jin-Woo emerged from as the victor. Why Did Sung Jin-Woo Not Join The Raid Earlier? Placing Family First And Trust In Fellow Hunters Close Despite Sung Jin-Woo’s spectacular save and defeat of the monsters that rendered Jeju Island inhabitable, some fans believe there could have been a better outcome than the current one. This leads to the big question: Why did he not join the raid from the start? Chairman Go Gunhee personally asked him to join the raid, and he refused. Moreover, Sung Jin-Woo is not interested in political affairs, so the theory of waiting for Goto to die is also nullified. As seen in the anime and manga, Sung Jin-Woo decided to stay behind for his family. His mother had just been cured from Eternal Slumber , and he wanted to stay with her. He also believed in the power of the S-Rank hunters partaking in the mission and their ability to handle the situation. He even took measures such as designating his shadows to several hunters should there be any need to use Exchange. Shadow Limitations And Broadcast Delay Considering Sung Jin-Woo had planted his shadows on several hunters, how did he not know when the massacre began? Some fans theorize that while Sung Jin-Woo might have had shadows on these hunters, he had not gained the ability to share senses with them at this point in the series and would only be aware should one of them die. This theory appears concrete as it was after Goto’s death that he had appeared. Min Byong-Gu did not have a shadow on him, so there was no way he would have been aware. While the broadcast would have been a more convenient tracking method for the hunters’ status, it had a 10-minute time lag. This meant that everything being broadcast happened 10 minutes earlier, giving the Ant King enough time to amass a lot more kills before Sung Jin-Woo would know. However, Sung Jin-Woo only watched the broadcast in the manga, as he explicitly stated that he did not feel the need to watch it in the anime. Thankfully, he showed up when he was needed either way. How Sung Jin-Woo Could Have Prevented The Massacre Deploying Stronger Shadows Close While Sung Jin-Woo has his reasons for not joining the raid from the start and cannot be entirely blamed for the delay in his intervention, fans still believe there are ways he could have prevented the massacre from happening. Sending stronger soldiers to join the hunters is one of the curated solutions. While respecting his decision to remain at his mum’s side, the foot soldiers he placed on the hunters were not strong enough for the regular ants, let alone the Ant King. They also do not act without orders, making them nothing but signals of death. Soldiers such as Igris and the High Orcs would have been a better option , as they are stronger and capable of reasoning. Even though they might not have safeguarded everyone, the numbers of lost hunters would have been reduced. He would have also been aware of the tough situation via mana usage by these soldiers, leading to a faster response time and further reducing casualties. Given that the Ant King was an anomaly, there is not much else he could have done to prevent this massacre without hands-on information. The Significance Of Sung Jin-Woo’s Actions Exposing Japan’s Hidden Agenda While Sung Jin-Woo’s decision might not have been the right call to prevent the massacre, it did expose the secret intentions Japan had in sending its hunters to aid in the Jeju Island raid. While volunteering to take care of the ants outside of the colony seemed noble of the Japanese hunters, it was actually a scheme to protect themselves while the Korean hunters would be sent to their doom. They had even planned on making Goto a National-Level hunter as a side quest. Unfortunately for them, Sung Jin-Woo’s untimely entrance completely foiled their plans as nearly all their hunters, including Goto, lost their lives to the Ant King. However, Sung Jin-Woo was timely enough to save all the Korean S-Rank hunters except Byung-Gyu, making Japan’s secret mission a complete failure. Solo Leveling TV-MA Action Adventure Animation Fantasy 262 9.8 /10 Release Date January 7, 2024 A-1 Pictures' Solo Leveling is an anime based on Chugong's popular web novel. Set in an unforgiving fantasy world where hunters explore dungeons filled with monsters, the vulnerable Sung Jinwoo gains a significant power boost after he is picked to be a solo player by the System. Studio A-1 Pictures Creator Chugong Number of Episodes 25 Streaming Service(s) Crunchyroll Powered by Expand Collapse Anime Follow Followed Like Share Facebook X LinkedIn Reddit Flipboard Copy link Email Close Thread Sign in to your Game Rant account We want to hear from you! Share your opinions in the thread below and remember to keep it respectful. Would you rather see a hero prioritize personal obligations first, or always act for the greater good no matter the cost? Oluwatokiloba-Folami Oluwatokiloba-Folami Oluwatokiloba-Folami #SD650444 Follow Me Followed 1  Follower Following 1 Authors 0 Articles 0 Topics Contributor 2 Posts 0 Ratings 0 Reviews 0 Threads 5 hours ago The most compelling heroes often struggle between both—and that conflict is what makes their story meaningful. Reply / Post Images Attachment(s) Please respect our community guidelines . No links, inappropriate language, or spam. Your comment has not been saved Send confirmation email This thread is open for discussion. Be the first to post your thoughts. Terms Privacy Feedback Popular Solo Leveling Season 2 Finale Introduces A Hunter Even Stronger Than Sung Jinwoo Solo Leveling There's a hunter stronger than Sung Jinwoo. He was shown in the last episode of season 2 of Solo Leveling. Posts By Rei Penber 22 hours ago Dragon Ball: Why Goku Doesn't Use Kaioken While In Super Saiyan Form, Explained Posts 5 By Laura Gassert 2 days ago My Hero Academia: 8 Strongest Quirks In Vigilantes Posts By Julián Jorge  Fernández Loyarte 3 days ago Solo Leveling: 7 Strongest Dungeon Bosses, Ranked Posts By Mirza Aaqib Beg 2 days ago 'The Best Anime Is Back': One Piece Episode 1123 And 1124 Titles Revealed Posts By Rei Penber 3 days ago Solo Leveling Season 2 Finale Reveals A National Level Hunter Posts By Suzail Ahmad 1 day ago Recommended Genshin Impact Leaks Major Lore Characters for Version 5.6 Genshin Impact Version 5.6 is set to be an important crossroads for Genshin Impact, as a recent leak reveals that several lore figures will have voiced roles. Posts 1 hour ago Dragon Ball Super Vol. 24 Gives Fans A Fresh Look At Black Frieza Dragon Ball Not only does Dragon Ball Super Volume 24 have one of the best covers, but it also has a cool back cover. Posts 4 hours ago One Piece: The D Clan Traitor In The Void Century, Explained One Piece The void Century is still full of mysteries. There was a traitor in the D clan that led to the downfall. Posts 2 hours ago Boruto: Sarada Uchiha's Second Mangekyo Sharingan Ability, Explained Boruto Sarada has a lot of potential in Boruto. She has a second Mangekyo Sharingan Ability. Posts 55 minutes ago Nintendo's Big Challenge: The Legend of Zelda Is Going To Be Harder To Adapt Than Mario The Legend of Zelda Movie Nintendo's next big film release may prove to be more difficult. Posts 3 hours ago The Unwritten Rules of The First Berserker: Khazan Explained The First Berserker: Khazan The First Berserker: Khazan has a steep difficulty curve, though players can overcome this curve by relying on a few unwritten rules. Posts 3 hours ago Trending Now Solo Leveling: 7 Strongest Characters Yet to Debut in the Anime Solo Leveling: 8 Reasons Season 3 Will Be Better Than Season 2 One Piece: Oda Confirms An Advanced World From 3000 Years Ago Join Our Team Our Audience About Us Press & Events Media Coverage Contact Us Follow Us Advertising Careers Terms Privacy Policies Game Rant is part of the Valnet Publishing Group Copyright © 2025 Valnet Inc."
  },
  "https://otakusnotes.com/who-is-sung-jin-woo/": {
    "url": "https://otakusnotes.com/who-is-sung-jin-woo/",
    "content": "Who is Sung Jin-Woo? Power & All Abilities | Solo Leveling - OtakusNotes Skip to content Home » Anime & Manga » Who is Sung Jin-Woo? Power & All Abilities | Solo Leveling Menu Home Anime & Manga Attack on Titan Black Clover Dr. Stone Jujutsu Kaisen Kengan Omega My Hero Academia One Piece Webtoon Noblesse Solo Leveling Tower of God K-Drama Top 10s Who is Sung Jin-Woo? Power & All Abilities | Solo Leveling February 12, 2024 by Jiyad Shaikh Solo Leveling is a renowned South Korean manga web novel by Chu-Gong. The novel was later adapted into a webtoon illustrated by Jang Sung-Rak. Exploring distinctive themes related to fantasies and the dark realm where monster-like creatures reside provides the narrative with a dynamic allure. The series’s main protagonist appears to be a typical human being; after discovering a system, his life undergoes a drastic change. This article will examine the depths of the series’ main protagonist, Sung Jin-Woo. Although the followers of Solo Leveling are already familiar with Jin-Woo’s abilities and powers , through this article, we are diving deep into this character and taking a close peek. Who is Sung Jin-Woo in Solo Leveling? Sung Jin-Woo is the central character portrayed as a protagonist in the series, around whom the story revolves. It all begins with the introductory phase of Jin-Woo as an E-Rank Hunter, usually considered weak, contrasting this with becoming the strongest in the Solo Leveling universe. He is comparable to a typical protagonist, starting with a weak depiction and then getting stronger through rigorous training as the story unfolds. Jin-Woo, back in the days when he was weak, used to be a short, skinny guy with hair long enough to cover his ears. His facial structure was also odd in that he looked way younger than his actual age, seeming even younger than his sister, Jinah. Everything changed after an event occurred in his life, leading to significant changes. I. How Sung Jin-Woo Gains New Power and Abilities Initially, Sung Jin-Woo, the protagonist, was an E-Rank Hunter with minimal strength and was notably less influential in the Hunter community. This thing comes to a halt soon after JIn-Woo is chosen by the System, a peculiar magical program that only he can access. The system allowed him to grow stronger by elevating his strength in every way possible, without restraint. Subsequently, Jin-Woo senses it as an advantage, eventually growing strong enough to earn the status of humanity’s most excellent hunter and the decisive second Shadow Monarch. In addition to this, he also develops an iconic ability, “Shadow Extraction.” This ability allows him to turn the defeated opponents into his loyal soldiers. It does not end here; despite already being immensely strong, these shadows kept getting even more substantial as Jin-Woo grew stronger. II. His Powers Jin-Woo, in his developmental phase, undergoes versatile changes and amplified transformation. As he levels himself up, he eventually becomes the most excellent hunter. Let’s dig into his character more and understand him comprehensively. -> Tremendous Strength After the system bestows its powers upon Jin-Woo, he gains significant strength. Even before obtaining his powers, he could punch a massive hole through the face of the Statue of God; subsequently, he became stronger. This becomes more compelling when Thomas Andre, who is one of the National Level Hunters in the series, is defeated by Jin-Woo. Jin-Woo surpasses him with ease. Jin-Woo has proven his worth as humanity’s most excellent hunter several times. However, notably, by the end of the series, he maxes out his strength, speed, and stamina, unveiling a new aspect of the story. Such enormous progress makes him one tough guy to fight, quickly becoming invincible against his opponents with years of training and battle experience. -> Immense Speed Jin-Woo’s super speed is undoubtedly a spectacular and practical sight. He appears to be so fast that even his opponents have a hard time tracking his movements. Apparently, during his confrontation with the Frost Monarch, he overpowers the beat in terms of speed. He moves with incredible speed, swiftly slicing the hand of the Shadow Monarch. It was a massive loss for the beast, as he could not discern the intense attack and remained still. It was only after his limb fell off that he acknowledged it. This is just one instance where Jin-Woo showcases his speed of attacks and his grasp over his skills; however, there are still many incidents where he proves his lightning speed. Possessing such overwhelming powers establishes him as a feared opponent among his foes. -> Robust Endurance He is comparably a tank, taking hits like they are nothing to him. Considering his encounter with the Ant King, JinWoo’s durability becomes evident, barely flinching to the punch right in his face. This suggests his strength and displays his resilience to such lethal hits. Another instance where he demonstrates why the series revolves around him can be traced back to his confrontation with the architect. During the brutal battle between these two superhuman beings, JIn-Woo apparently shocks everyone by giving up and returning with the same strength even after suffering severe wounds. Such remarkable endurance and a never-giving-up attitude not only demonstrate his physical capabilities but also underscore his suitability for the role of the strongest hunter. Follow Us on Telegram III. His Abilities -> Shadow Extraction It is one of the iconic and noteworthy abilities that Jin-Woo possesses. The Shadow Extraction technique allows our guy to revive a beast or hunter he defeats. He can summon the dead beings’ souls as overwhelmingly strong shadows. This technique is activated through a predefined keyword without risking losing mana in its utilization. The best part is its effective range, which can be applied over a large radius. The user here, Jin-Woo, can extract shadows on a considerable scale—hundreds simultaneously. He has an army of these powerful beings, the shadow army. Jin-Woo has numerous shadows under his command, giving him an upper hand in his battles. -> Regenerative Healing Factor Along with the explosive growth in his physical strength, Jin-Woo also develops a healing ability. This ability to regenerate helps him recover from several severe injuries and physical traumas. The efficacy of this technique evolves as he levels up, eventually complementing his physical prowess and granting him an advantage over his adversaries. In other words, it can be described as a trump card, bestowing Jin Woo with the ability to return to normal instantly after injuries. Such a game-changing ability is one of the iconic possessions in solo leveling. His regenerative ability becomes a prominent and significant aspect of his toughness, establishing him as an intimidating yet exciting protagonist. -> Shadow Exchange and Dimensional Travel It extends Jin-Woo Shadow Extraction. The Shadow Exchange ability allows Jin-woo to swap his location with any of his shadows at his woll, regardless of the distance they are located. A glimpse of his Shadow Exchange ability was demonstrated when a menacing monster attacked and almost killed his sister. He swiftly swaps with the shadow he assigned to guard his sister, averting potential tragedy. By the end of the series, he becomes capable enough to enhance this ability into a dimensional proficiency. In other words, he could create gates or simply portals, enabling him to travel to any location within the universe. These “gates” can be so massive, fitting thousands. IV. How Powerful Sung Jin-Woo I s In Solo Leveling Although initially he was just a regular guy, as soon as he underwent drastic transformations, he never turned back again. As the series ends, Jin-Woo achieves mastery over his shadows and mana. He even reaches a state where he becomes invincible and has unparalleled potency, enhancing all his attributes—strength, speed, stamina, and magic—to their maximum potential. This acceleration in his powers and abilities sets him apart from the rest and makes him an unbeatable opponent for his foes. Being the “Shadow Monarch,” he attains an immense boost, surpassing those of the strongest hunters in the world of solo leveling. V. Why is Sung Jin-Woo the chosen one? Originally, Sung Jin-woo was an E-Rank Hunter, but he was chosen by Ashburn, the original Shadow Monarch, to be a successor. This event changed Jin-Woo’s life dramatically, granting him abilities to elevate his strength. The architect tries to find a new body for Ashborn to inhabit, but Jin-Woo grows unexpectedly strong, which is a hurdle. Subsequently, Jin-Woo defeats the architect and Asborndenies to get reincarnated into Jin-Woo’s body, giving him all of his powers as a successor. CONCLUSION In conclusion, Sung Jin-Woo’s character endures notable changes in his life. From being a regular weak individual to becoming the strongest character in Solo Leveling, Jin-Woo proved his worth as the series’ main character. Despite this, it is essential to note that he only establishes himself through his exquisite determination and struggles. The depiction of Sung Jin-Woo is remarkable, as the series’ journey keeps leveling him up, resulting in his transformation into an absolute beast. Do small things with great love. Follow us on Twitter for more post updates. Also Read Top 45 Strongest Solo Leveling Characters Ranked Top 20 Strongest Shadows of Sung Jin-Woo in Solo Leveling Ranked Top 15 Main Characters In Solo Leveling Jiyad Shaikh I am a first-year student pursuing Data Science and Artificial intelligence and have always been mesmerised by AI and wish to build one for my own in future. In my free time, I like to watch Romance Anime or read Seinen Manga. One Piece Quiz Join us in the Quiz to test your familiarity with Luffy's Gear 5. (You Won't be able to Answer) 1 / 10 Name of Sukuna’s Cursed Tools Black Rope &amp; Slaughter Demon Kamutoke &amp; Hiten Inverted Spear of Heaven &amp; Soul Spit Katana Executioner Sword 2 / 10 How did Sukuna's Fingers Taste Like? Decayed flesh Wax Soap Brown Grass 3 / 10 From which country does Momo Nishimiya's father originate? America Germany Japan Korea 4 / 10 Which character among the following might not be straight? Nobara Kugisaki Masamichi Yaga Momo Nishimiya Mai Zenin Explanation: An extra in one of the volumes states that whenever Mai interacts with other female characters, they look like a pair of lovers. Explanation: An extra in one of the volumes states that whenever Mai interacts with other female characters, they look like a pair of lovers. 5 / 10 What songs did Gege Akutami suggest as theme songs for Gojo Satoru? \"Flavor of Life\" by Utada Hikaru (2007) &amp; \"PonPonPon\" by Kyary Pamyu Pamyu (2011) \"Haruka Kanata\" by Asian Kung-Fu Generation (2004) &amp; \"Silhouette\" by KANA-BOON (2014) \"Mada Minu Asu Ni\" by Asian Kung Fu Generation (2008) &amp; \"Shame on Me\" by Avicii (2013) \"Hana\" by Orange Range (2005) &amp; \"Sakura Nagashi\" by Utada Hikaru (2012) 6 / 10 Luffy's strongest ability in Gear 5 The Power To Turn Things Into Rubber The Ability To Gain Enormous Size Ultimate Rubber Defense The Drums Of Liberation 7 / 10 What is the reason for Luffy's constant laugh while using Gear 5? Because Gear 5 grants him unparalleled strength and defense Because Gear 5 allows him more freedom and joy Because he enjoys fighting in Gear 5 Because he can defeat anyone in Gear 5 8 / 10 Known Limitations of the Gear 5 Transformation Time Limit His own imagination and stamina Heavy Haki consumption Less Speed and Easy To Target 9 / 10 Which characters pose a significant challenge for Luffy while he's in Gear 5? Shanks/Mihawk Akainu Trafalgar D Law Blackbeard 10 / 10 Which characters have witnessed Luffy In Gear 5 by One Piece Chapter 1092? Kaido, Momonosuke, Yamato Kaido, Momonosuke, Yamato, The Straw Hats, Vegapunk, Kizaru, Lucci, Bonney Lucci, The Straw Hats, Kaido, Momonosuke, Yamato, Vegapunk, Kizaru, Bonney, Saturn, Kid, Law The Straw Hats, Kaido, Momonosuke, Yamato, Vegapunk, Kizaru, Bonney, The WG, Shanks Your score is The average score is 41% 0% Restart quiz Navigation About Us Contact Us Meet our Team Privacy Policy Cookie Policy DMCA Policy Disclaimer Copyright Terms of Service Affiliate Disclosure Some hyperlinks in this post are affiliate links. This means if you click on the link and purchase the item, Otakusnotes.com will receive an affiliate commission at no extra cost to you. All opinions still remain our own. Latest Posts Top 15 Hottest Anime Vampire Boys/Guys In 2024 Top 15 Best Mission Yozakura Family Characters 15 Famous Black Female Basketball Players, 2024 15 Best Cartoon Characters With Freckles About Us Otakusnotes.com is one stop source for latest Rankings, Comparisons, and Theories from the world of Anime, Manga, & Webtoons. © OtakusNotes | 2025 | All Rights Reserved"
  },
  "https://beebom.com/solo-leveling-sung-jinwoo-powers-abilities/": {
    "url": "https://beebom.com/solo-leveling-sung-jinwoo-powers-abilities/",
    "content": "Solo Leveling: Sung Jinwoo's Powers and Abilities Explained | Beebom Skip to content Beebom News Opinions Reviews Gaming Pokemon Go Helldivers 2 Dragon’s Dogma 2 Valorant Palworld Wuthering Waves Roblox Genshin Impact Counter Strike 2 Honkai Star Rail Lego Fortnite Minecraft Fortnite Wordle Stardew Valley NYT Strands NYT Connections Tech Apps Instagram WhatsApp Facebook Discord X Snapchat Spotify Apple iOS iPad Mac Apple Watch AirPods Vision Pro Android AI Internet Windows Chromebook Hardware Entertainment Streaming Apps Netflix Hulu Disney+ Crunchyroll Prime Video DC Marvel Anime One Piece Naruto Boruto Jujutsu Kaisen Demon Slayer Chainsaw Man Solo Leveling Beebom Gadgets Beebom Gadgets Search For : Search For : Search Results Load More News Opinions Reviews Gaming Pokemon Go Helldivers 2 Dragon’s Dogma 2 Valorant Palworld Wuthering Waves Roblox Genshin Impact Counter Strike 2 Honkai Star Rail Lego Fortnite Minecraft Fortnite Wordle Stardew Valley NYT Strands NYT Connections Tech Apps Instagram WhatsApp Facebook Discord X Snapchat Spotify Apple iOS iPad Mac Apple Watch AirPods Vision Pro Android AI Internet Windows Chromebook Hardware Entertainment Streaming Apps Netflix Hulu Disney+ Crunchyroll Prime Video DC Marvel Anime One Piece Naruto Boruto Jujutsu Kaisen Demon Slayer Chainsaw Man Solo Leveling Beebom Gadgets No results found Home > Entertainment > Anime > Solo Leveling: Sung Jinwoo’s Powers and Abilities Explained Solo Leveling: Sung Jinwoo’s Powers and Abilities Explained Aparna Ukil Published: January 4, 2025 Comments 0 Share Copied Solo Leveling’s Jinwoo has become the embodiment of the “Overpowered protagonist.” Whenever we hear the word “strong hero,” we always compare them with our beloved Hunter. However, one may wonder what exactly makes our leveling-up hero Jinwoo the strongest of all in the world of Solo Leveling. Well, let’s discuss Jinwoo’s powers and abilities in detail to get an answer to that question. Spoilers Warning This article contains heavy spoilers about the shadows of Sung Jinwoo. Thus, we highly suggest you to read the manhwa completely beforehand in order to avoid ruining your intended experience. Sung Jinwoo’s Powers and Abilities Jinwoo started out as an average human being who can’t even defeat a low-tier monster, let alone Monarch or Rulers. However, by the end of the manhwa, Jinwoo basically becomes a God. Every protagonist holds immense strength or speed, but Jinwoo has multiple powers and abilities in his arsenal. He not only transforms into the strongest Solo Leveling Hunter with these powers, but he also becomes the strongest being in the entire world. 1. Superhuman Strength Image Credit: A-1 Pictures (via X/sololeveling_en) Being Sung II Hwan’s son, how can Jinwoo not be born with the immense physical strength that helped him damage the Statue of God before getting chosen by the System? However, the boy never really knew his true potential and spent his early days as one of the lowest-skilled E-ranked hunters. After nearly getting killed in the double dungeon and getting chosen by the System, Jinwoo sees an immeasurable evolvement in his physical strength. Jinwoo’s strength was evidently strong when he fought Igris . Even though Igris was more experienced in battle, Jinwoo was able to overwhelm the other-world entity with his kicks and punches. Another example of Jinwoo’s strength was his fight against enemies like Rakan and Antares. He defeated the Beast Monarch in just four punches. On the other hand, he was able to survive and even beat Antares, the strongest of Monarch, with his strength. 2. Lightning Fast Speed Strength isn’t the only strong suit of Jinwoo, as the character also flaunts incredible speed. In the fight against Rakan, Jinwoo attacked at such a superhuman speed that even the Monarch couldn’t track the Hunter’s movements. Jinwoo is already faster than the speed of light (by the end of the manhwa), but the System allows the character to go even further by increasing his speed by 30%. Related Articles 10 Best Solo Leveling Arcs (Ranked) Ajith Kumar Apr 15, 2024 12 Strongest Solo Leveling Characters, Ranked Aparna Ukil Apr 8, 2024 3. Incredible Regeneration Ability With strength and speed comes Jinwoo’s incredible regeneration ability. The System allows him to regenerate and overcome his injuries at a godly speed. There are also multiple healing items in Jinwoo’s inventory that he can use during a battle to replenish his stamina or heal his body. Also, let’s not forget that Jinwoo is also immune to all forms of poison or illness, all thanks to Ashborn’s powers. 4. Incredible Fighting Skills Image Credit: A-1 Pictures (via X/sololeveling_en) Jinwoo doesn’t have much experience in battle, but thanks to the System and his sheer will, the Hunter develops incredible fighting skills. Even before fully tapping into Ashborn’s powers, Jinwoo showed impressive fighting ability against Igris. He very smarty adapted to new strategy while fighting the opponent. He knew exactly when to use his dagger to block Igris’ sword attacks, and even in hand-to-hand combat, the Hunter was able to see through the enemy’s movements. Jinwoo realized that he’d have to fight a perfect balance between speed and strength to overcome Igris. Without even knowing his opponent and the extent of his abilities, Jinwoo was able to learn and adapt new fighting skills with his feet in the battle. 5. Gets Stronger After Every Fight Of course, everyone grows stronger after training, but Jinwoo had an RPG system backing him up. After completing a Dungeon and leveling up, Jinwoo used the points to grow stronger. He assigned those points to his strength, speed, weapons, agility, intelligence, etc. In short, the Hunter grows stronger after each completing each Guild or Gate. While there’s always a limit to how much a human can grow or learn, there is absolutely no limit to Jinwoo’s growth. He can basically become a God after exploiting the System to its full potential. 6. Access To Unlimited Weapons The System allows Jinwoo to access an inventory of unlimited weapons . After completing each Guild or simply leveling up, Jinwoo can unlock new abilities and weapons. While our hero uses the points to increase his strength, speed, or other physical traits quite often, he also uses the points to unlock new weapons or healing items. Guild maps, healing potions, and weapons such as the Knight Killer dagger are some of the items in Jinwoo’s inventory. And if that’s not enough, Jinwoo can also use the digital shop in the inventory to buy and sell items as per his needs. Also, he doesn’t need a physical bag to hold these items. If Jinwoo is done using his dagger, he can just put that back in his inventory digitally in the blink of an eye. Related Articles How Did Sung Jinwoo Become the Shadow Monarch in Solo Leveling? Ajith Kumar Mar 30, 2024 Solo Leveling: Sung Jinwoo’s Strongest Shadows, Ranked Ajith Kumar Jan 4, 2025 Who is Igris in Solo Leveling? Explained Ajith Kumar Mar 30, 2024 7. Shadow Extraction While many fear Shadows, Jinwoo embraces the darkness; in fact, he can use the Shadows to grow stronger. Jinwoo holds the power of Shadow Monarch , which allows him to mold the darkness to his liking. He can give physical form to Shadows. We have seen that when Jinwoo uses the Shadow to create a big armor , which also makes him look like Ashborn. Jinwoo also flaunts the Shadow Extraction for this exact reason. Control over Shadows allows the Hunter to resurrect anyone he defeats. Interestingly, Jinwoo creates a massive Shadow army by defeating countless enemies and making them his minions. It all started with Igris, and later on, we see Jinwoo extracting Hwan Dong-Su’s Shadow and renaming it “Greed.” We have also ranked Sung Jinwoo’s shadows in a dedicated guide, so check it out right here. That’s not it, though, as the control over Shadows allowed Jinwoo to swap places with his Shadows, or should we say teleport to a different location. If one of his Shadows is in the US and Jinwoo is in Korea, he can swap places with his Shadow and teleport to the US within a second. 8. A Being Beyond Time Image Credit: A-1 Pictures (via X/sololeveling_en) By the end of the manhwa, Jinwoo achieves Acausality as well. It means that our beloved Hunter transcends time and space. We all know that time is like a fabric, and while for humans, time only flows in one direction, for supernatural entities, time isn’t a foundation at all. For Jinwoo, there’s no past, present, and future . He exists in multiple timelines and will be unaffected if someone kills him by traveling to the past. Jinwoo will still exist in another timeline or future. In a sense, Jinwoo truly becomes immortal after achieving “Acausality.” 9. Complete Control Over Another Dimension Jinwoo becomes a God by the end of the story, and that is evident from the fact that he gets control over another dimension. This dimension, called Territory of Eternal Rest, is infinite in size, and only Jinwoo can access it or bring someone there. In this dimension, Jinwoo can alter anything simply through a thought. Basically, he can shape this world to his own liking. In the end, Sung Jinwoo becomes an immortal being who can’t be killed. On top of that, he becomes an Omnipotent being, proving that absolutely nobody is above him. #Tags #Solo Leveling Aparna Ukil Aparna is the Senior Entertainment Writer at Beebom. She started her professional journey in the retail industry but her admiration for films and TV shows pulled her into the field of entertainment writing where she has experience writing for various well-known publishers including Otakukart, Sportskeeda, Game Revolution, Forever Geek and Dexerto. Comments 0 Leave a Reply Cancel reply Add new comment Name Email ID Δ Loading comments... Recommended Articles The Beginning After the End Release Date and Time (Countdown Timer) Aparna Ukil Who Is Stronger than Sung Jinwoo in Solo Leveling? Ajith Kumar One Piece Chapter 1144: Franky Finally Gets His Time to Shine Ajith Kumar Solo Leveling Season 3: When Is It Coming Out? Ajith Kumar Solo Leveling Season 2 Ending Explained: What’s Next for the Shadow Monarch? Aparna Ukil Solo Leveling: Is Sung Jinwoo Stronger Than National Level Hunters? Aparna Ukil Solo Leveling: How Does Jinwoo Save Cha Hae-In on Jeju Island? Ajith Kumar Trending Stories in #Solo Leveling 01 Solo Leveling Season 2 Episode 13 Release Date and Time (Countdown) Ajith Kumar 02 All Solo Leveling Arcs in Order Ajith Kumar 03 Solo Leveling: Ragnarok Chapter 46 Gets Delayed; Here’s Why Aparna Ukil 04 The Best Websites to Read Manhwa Legally Ajith Kumar 05 Solo Leveling Season 2 Episode 12 Release Date and Time (Countdown Timer) Ajith Kumar Beebom is one of the leading consumer technology websites aimed at helping people understand and use technology in a better way. About Us Careers Get in touch Advertise Privacy Policy Editorial Guidelines Beebom is one of the leading consumer technology websites aimed at helping people understand and use technology in a better way. About Us Careers Get in touch Advertise Privacy Policy Editorial Guidelines © Beebom Media Private Limited"
  },
  "https://trengezie.com/sung-jin-woo-solo-leveling-powers-skills-weapons/": {
    "url": "https://trengezie.com/sung-jin-woo-solo-leveling-powers-skills-weapons/",
    "content": "Sung Jin Woo - Solo Leveling: Powers, Skills, Weapons, Wife » Trengezie Close Menu Facebook X (Twitter) Instagram Actors & Actresses Biography Celebrity Kids Gospel Artists Media Celebrities Models Musicians & Rappers Home » Sung Jin Woo – Solo Leveling: Powers, Skills, Weapons, Wife Biography Sung Jin Woo – Solo Leveling: Powers, Skills, Weapons, Wife By Trengezie November 5, 2023 No Comments 4 Mins Read Facebook Twitter Pinterest Share Facebook Twitter LinkedIn Pinterest Email Sponsored Links Table of Contents Toggle Who is Sung Jin Woo? Biography Appearance Personality Powers Weapons Profile Summary Full Name Alias Origin Occupation Powers/Skills Family Friends/Allies Shadows Who is Sung Jin Woo? Sung Jin-Woo (성진우, seongjin-wu) is the main character in the web novel Solo Leveling. He was formerly a very weak E-Rank Hunter, but when he was chosen as the Player of the System, he was given the chance of a lifetime and was given the power to grow stronger without limits. Jinwoo eventually ascended to power as humanity’s greatest hunter and the second Shadow Monarch by making use of the possibilities provided to him by the System. Biography Being the older brother of Sung Jin-Ah, Sung Jin-Woo is the oldest child of Sung Il-Hwan and Park Kyung-Hye. Soon after being awakened, his father, a firefighter, began entering the Dungeon to earn money, but he soon disappeared. After his mother was diagnosed with the Eternal Slumber Disease, Jin-Woo, a graduate, began working in the dungeons to help support his family and pay for his mother’s medical expenses while also caring for his younger sister. Appearance Sung Jin-Woo is a tall, good-looking young man with black hair, gray eyes, and angular features. His eyes glow vivid purple when he is using his abilities or when he is angry. He almost usually appears dressed in gloomy colors, especially black. Prior to this Jin-Woo wasn’t that good-looking and he wore basic clothing due to his lack of funds. However, everything changed when he was chosen by the System. Personality Jinwoo is a self-assured man with a strong sense of loyalty to his family and a desire to attain power. He loves his mother Park Kyung-Hye and sister Sung Jinah dearly. Furthermore, it should be emphasized that despite being the world’s strongest hunter, Jinwoo is not overly haughty and is friendly and kind in person. Powers Despite being an Awakened Human with physical prowess greater than that of other humans, Sung Jin-Woo was weaker than other Hunters of higher ranks and nearly died multiple times in lower-level dungeons. But after his Reawakening in the Double Dungeon, he became a Player and was able to level up and get stronger almost like a gamer. Since then, Jin-Woo has leveled up steadily by completing the many dungeons and unique ones to which he had exclusive access and developing his skills and powers by utilizing the System. Jinwoo, the Shadow Monarch’s vessel, is the world’s strongest hunter and far surpasses the raw power of the seven Rulers’ vessels. Therefore he possesses the following abilities below. Stealth Immense Strenght Quicksilver Armor Creation Mutilation Dragon’s Fear Unlimited Inventory Regenerative Healing Factor Bloodlust Dagger Rush Shadow Extraction Shadow Preservation Domain of the Monarch Ruler’s Authority Shadow Exchange Weapons Demon King’s Daggers: A pair of daggers that the Demon King Baran once wielded. It possesses a second ability called “Two as One,” which boosts each dagger’s attack power in accordance with the user’s strength stat. Demon King’s Longsword: A longsword that Baran once wielded. It possesses a second effect called Storm of White Flames that causes a tiny lightning storm to appear in the designated region. Kasaka’s Venom Fang: a weapon fashioned out of Kasaka’s Venom Fang. It paralyzes and causes bleeding. Kamish’s Wrath: A pair of daggers crafted from the dragon Kamish’s fang. They are mana-sensitive, which means that their user’s strength stat determines how powerful they are. They also let the user change their weight as they see fit. Knight Killer: A dagger made for combating opponents wearing armor. It increases damage against opponents wearing armor by 25%. Baruka’s Dagger: A dagger formerly wielded by Baruka, an elven warlord. Profile Summary Full Name Sung Jin-Woo Alias 성진우 E-Rank Hunter World’s Weakest Hunter The One Who Overcame Adversity Wolf Slayer South Korea’s 10th S-Rank World’s Strongest Hunter Demon Hunter Origin Solo Leveling Occupation Hunter Guild Leader S-Rank Hunter Shadow Monarch National Level Hunter Powers/Skills Awakened Human: Enhanced Condition Low Mana Reawakened Human (Player): Vital Strike Mutilate Dagger Throw Dominator’s Touch Dominator’s Authority Advanced Dagger Arts Immense Mana Superhuman Condition Strength Speed/Agility Durability Stamina/Endurance Regeneration Bodily Restoration Limitless Growth Shadow Monarch Powers: Reanimation Shadow Summon Shadow Save Shadow Exchange Shadow Monarch’s Domain Family Sung Il-Hwan (Father) Park Kyung-Hye (Mother) Sung Jin-Ah (Little Sister) Yoo Jinho (Brother-In-Law) Cha Hae-In (Wife) Sung Suho (Son) Friends/Allies Song Chi-Yul Lee Ju-Hee Yoo Jin-Ho Shadow Soldiers Han Song-I Go Gun-Hee Cha Hae-In Park Hee-Jin Shadows Igris Tank Iron Tusk Kaisel Beru Jima Kamish (Temporarily) Greed Bellion This article was sourced from hero.fandom.com and solo-leveling.fandom.com Sponsored Links Share. Facebook Twitter Pinterest LinkedIn Tumblr Email Previous Article Aida Osman Age, Biography Net Worth, Boyfriend, Height Next Article Vanesu Samunyai (Kyo Ra) Age, Biography, Net Worth, Boyfriend, Height Related Posts Pastor Michael Todd Age, Biography, Net Worth, Wife, Children March 29, 2025 By Trengezie Beautiful Celebrity Women with Green Eyes March 5, 2025 By Trengezie Kiana Danial Biography, Age, Net Worth, Husband, Height February 20, 2025 By Trengezie Add A Comment Leave a Reply Cancel reply Recent Posts Dax (Rapper) Age, Biography, Net Worth, Girlfriend, Height Pastor Michael Todd Age, Biography, Net Worth, Wife, Children BabyTron Age, Biography, Net Worth, Girlfriend, Height TDK Macassette Age, Biography, Net Worth, Boyfriend, Height Mia Rodriguez Age, Biography, Net Worth, Partner, Height Iyana Halley Age, Biography, Net Worth, Boyfriend, Height Madison Thompson Age, Biography, Net Worth, Boyfriend, Height, Navia Robinson Age, Biography, Net Worth, Boyfriend, Parents, Height About Us Trengezie is a website/blog that offers you facts about public figures/celebrities such as their biography, career, age, net worth, & more. Facebook Pinterest YouTube Latest Posts Dax (Rapper) Age, Biography, Net Worth, Girlfriend, Height March 31, 2025 Pastor Michael Todd Age, Biography, Net Worth, Wife, Children March 29, 2025 BabyTron Age, Biography, Net Worth, Girlfriend, Height March 28, 2025 Categories Actors & Actresses Biography Celebrity Kids Gospel Artists Lifestyle Media Celebrities Models Musicians & Rappers © 2025 Trengezie All rights reserved. Privacy Policy Contact Us About Trengezie Terms and Conditions Copyright Submit Type above and press Enter to search. Press Esc to cancel."
  },
  "https://quotetheanime.com/solo-leveling/sung-jin-woo-wiki/": {
    "url": "https://quotetheanime.com/solo-leveling/sung-jin-woo-wiki/",
    "content": "Sung Jin-Woo | Solo Leveling (WIKI) - QTA Skip to content search Categories Menu Toggle Recommendations Anime Quotes FUNNY Cosplay Theories Gaming Latest Posts Store About Us Menu Toggle Join the Team Categories Menu Toggle Recommendations Anime Quotes FUNNY Cosplay Theories Gaming Latest Posts Store About Us Menu Toggle Join the Team search Main Menu Categories Menu Toggle Recommendations Anime Quotes FUNNY Cosplay Theories Gaming Latest Posts Store About Us Menu Toggle Join the Team Sung Jin-Woo | Solo Leveling (WIKI) Wiki | INFO , Action , Solo Leveling / By Mélissa Nassif /  August 6, 2022 Sung Jin-Woo - Solo Leveling Wiki Sung Jin-Woo is the protagonist of the Manhwa “ Solo Leveling” . Sung Jin-Woo started as the weakest E-Rank Hunter, he was just a bit stronger than a normal human. He was known as “ The World’s Weakest ” (Manhwa: Chapter 1). Even at this level, he decided to work as a Hunter to cover his mother’s medical bills and his sister’s education since his father has been missing for 10 years now after entering a Gate. Table of Contents Toggle Sung Jin-Woo - Solo Leveling Wiki Table of Content History Appearance Personality Strengths and Skills Shadow Extraction Command Phrase: Arise Domain of the Monarch Save Shadow Ruler’s Authority Stealth Shadow Exchange Longevity Bloodlust Immunity Mutilation Detoxification Tenacity Vital Strike Quicksilver Critical Chain Advanced Dagger Arts Dagger Throw Jin-Woo's Weapons Kim Sangshik’s Steel Blade Knight Killer The Orb of Avarice Baruka’s Dagger Devil King's Dagger The Long Sword of the Demon King Baran Kamish’s Wrath: Jin-Woo's Equipment Warden’s Necklace High Knight’s Chestplate High Knight’s Gauntlet High Knight’s Ring High Magicien Ring Archer’s Gloves Assassin’s Boots Red Knight’s Helmet Demon Monarch's Earring Demon Monarch's Necklace Demon Monarch's Ring Potions Rasaka’s Venom Mana Potion Healing Potion Holy Water of Life Items Dungeon Key Raikan's Fang Leather Pouch Bandages Warm Fur Coat Warm Gloves Demon Castle Key Warm Fur Coat Castle Door Key Cerberus Fang Volcan’s Horn World Tree Fragment Spring Water of the Echoing Forest Purified Blood of Demon King Titles Wolf Slayer The one who overcame adversity Summons Igris Hunter Kim Chul Tusk Kaisel Beru Jima Greed Kamish Quests The Courage of the Weak Demon Castle Job Change Relationships/Family Park Kyung-Hye Sung Il-Hwan Sung Jin-Ah Cha Hae-in Yoo Jin-Ho Final Verdict References Table of Content History There are two types of people living in Solo Leveling, the first type are normal people like you and me, the others are people who were reawakened . The reawakened are called “ Hunters ” and gain enhanced physical abilities as well as unique skills . Their main job is to clear Gates that are appearing all around the world. Inside those Gates or “Dungeons” dwell monsters and demons of all kinds. To successfully clear the Gate you first need to kill the Final Boss , like in a game . If not taken care of in time, the Gate breaks , and the monsters are released into the real world. One day, his raid party and he ventured into a C-Rank Dungeon where they found a Double Gate ( Manhwa: Chap 2) . The Double Gate was at least S-Rank and a massacre was inevitable. With no way to escape nor fight back, Sung Jin-Woo on the brink of despair finally realized that the Dungeon had rules . When they were just about to make it, his comrades betrayed him and left him behind to die . Miraculously, instead of dying, he experienced a Double Awakening and acquired the “ Black Heart ” of the Shadow Monarch . He was chosen by the system to become a “ Player, ” making him the one and only Hunter with the ability to constantly evolve and level up (Manhwa: Chapter 11). This is when it all begins . Sung Jin Woo Character Info Reveal Status (Spoilers) Alive Race: Human Birth: – Death : – Affiliations: -Rulers -The System Weapons: -Daggers -Kamish’s Wrath -Knight Killer -Demon King’s Daggers -Baruka’s Dagger More Information Gender: Male Relations Family (Spoilers) Sung Il-Hwan (Fathe/Dad) Jin-Ah (Sister) Park Kyung-Hye (Mother) Sung Su-Ho (Son) Cha Hae-In (Wife) Yoo Jin-Ho (Brother In Law) Appearances in ANIME/Manga Manhwa: Chapter 1 Light Novel: Chapter 1 Appearance Sung Jin-Woo is a ravishing Hunter. Not only handsome but intelligent as well. He has jet black hair , sharp gray eyes that show no emotions , defined muscles , and a smile that in its rare appearance, can make your heart melt. He is considered averagely tall and thin . His eyes, when angry or getting serious, start to glow in a light purple color that strikes fear into anyone who meets his gaze . He is shown most of the time wearing black tracksuits or formal black tuxes . Of course, he became like this after becoming a Player. Before his awakening, he was very thin but with no muscles at all, much shorter with long messy hair , till now he always wakes up with a bedhead . He looked much younger than his actual age. Personality Sung Jin-Woo has the complete and utmost confidence in his strength and abilities . He also knows his current limit and will retreat when facing an enemy stronger than he is to take the time to level up and try again after making the necessary preparations . He fights with his fists as well as his brain to make sure to always come back to his family. He puts his family’s life and safety above all else and will leave anyone or anything behind if they are in danger . He looks and acts like a cold , serious person and will only warm up to the people who acknowledge and respect him. While fighting, he is ruthless and looks more like a monster than a human. He does not hesitate to kill monsters or humans that he considers as despicable as monsters. He doesn’t have many friends and spends most of his time in Dungeons to level up and get stronger (Manhwa: Chapter 140). He will go to great lengths for the few people he calls Friends and will risk his life for any human life. Jun-Woo can be seen as cruel and scary but he has a golden heart that cares for everybody around him. His power made him a bit arrogant , he is nothing like his shy , impressionable former self . Jin-Woo can be disrespectful to people of high status and very polite with the persons that he respects even monsters if they earn his trust like Esil, the demon girl he met during the “Demon Castle” quest (Manhwa: Chapter 82). He is brave , danger does not scare him. This is a quality that he had even before gaining power. Our MC is not materialistic and doesn’t care about money or fame . He cherishes his privacy and dislikes attention . When he cleared the Jeju Island Raid by himself, he left all the magic crystals behind so the government could use them to rebuild (Manhwa: Chapter 106). When he was in the A-Rank Dungeon and saved the “Hunters” Guild raid party, he left all the Boss’s drops to the original owners of the Dungeon, he explicitly said that he shouldn’t be too greedy and only extracted the Boss’s shadow (Manhwa: Chapter 75). He also does not care if he is thanked or rewarded for all his good deeds. He saved Yoo Jin-Ho’s father from the “ Eternal Slumber ” and kept it a secret , he also saved multiple people’s lives very discreetly and left the scenes without any second thoughts to the matter (Manhwa: Chapter 139) . His ego is so strong that even the Shadow Monarch could not take over his body and he kept his consciousness even after his Black Heart awakened (Manhwa: Chapter 130). Strengths and Skills Sung Jin-Woo is the possessor of the Black Heart , the Vessel of the strongest Monarch, the Shadow Monarch , and has his strength and abilities. He is also a Player that can constantly level up , and has no limits as Norma Selner, the “ Upgrader ” revealed when she wanted to make Jin Woo surpass his limits. (Manhwa: Chapter 109) . This makes him the strongest Hunter in the entire world. Jin-Woo even has a chance to transcend the Monarchs and the Rulers alike. Not only does he have an extremely long list of skills and abilities at his disposition he also has the equipment to go with them. Shadow Extraction No Mana is required except for the regeneration of shadows. Shadow extraction is a unique skill possessed by the Shadow Monarch. It makes any of the defeated enemies, whether they are beasts or people, and revive them in the way that they become Jin Woo’s shadows. They come back to life as shadows whose only purpose is to follow the caster’s order. The only beings who are immune to this skill are beasts with souls that are evil to infinite extents. Like, one of the BEAST monarchs that we saw in the manhwa The extraction of the shadow can fail if the corps has been dead for too long or if the target is stronger than the caster. The Shadow Soldiers are summoned directly from inside Sung’s shadow and they are immortal. As long as he has Mana he can regenerate them indefinitely. He can also assign his Soldier to dwell inside other people’s shadows for protection, espionage are surprising attacks. Furthermore, every single shadow can level up and gain more power as they go to battle, most of them are now stronger than their original self Command Phrase: Arise Domain of the Monarch This power is a straight killer. Domain of the Monarch is such an overpowered ability that anyone in an RPG game will die to have. With the use of this power, Jin-Woo can temporarily increase the strength of his army, making them stronger and faster than they already were. Save Shadow No Mana Required. The ability to save the shadow that he extracted Ruler’s Authority A Pyro ability that allows Jin-Woo to control any objects even when he isn’t present. This gives him an edge over a lot of other strong characters. Stealth 200 Mana to extinguish all traces of you, 10 Mana per second to hide instantly . Stealth is an Assassin’s ability that hides away everything. It’s like, Jin-Woo didn’t even exist. From the smell to sound, he becomes a NINJA beast. Shadow Exchange Sung Jin-Woo can teleport himself and exchange bodies with any of the shadow soldiers no matter where they arc. This was seen multiple times in the Manhwa. Longevity Using Longevity , Jin-Woo won’t be affected by things like poison , and other substances that will cause harm to his body. Bloodlust Jin-Woo would kick the guy down. Effect “Fear” -50% of all stats. Immunity This will make Jin-Woo against all the critical hits or debuffs that cause problems to the player’s abilities. Mutilation Using a Dagger, Sung Woo can rip ANYONE into pieces. Detoxification Detoxification removes every harmful substance that will harm Jin-Woo’s body. Tenacity Using a Dagger, Sung Woo can rip ANYONE into pieces. Vital Strike 70 Mana. Using a Dagger, you learn to attack efficiently and deal critical damage to vital areas. Quicksilver Sung Woo surpasses his speed limitations by increasing it to 30% Critical Chain Usage of multiple daggers that will attack from all directs Advanced Dagger Arts Dagger Throw Sung Woo surpasses his speed limitations by increasing it to 30% Jin-Woo's Weapons Kim Sangshik’s Steel Blade Attack: +10 Rasaka’s Fang Obtained after defeating Rasaka (Manhwa: Chapter 17) Item Class: C Type: Dagger Attack: +25 Effect “Paralyse” attacked foes have a chance to become unable to move Effect “Bleed” attacked foes lose 1% of their health every 1 second Knight Killer Bought from the store Item Class: B Type: Dagger +75 Attack Effect “Knight Slayer”: it is used against an opponent with heavy armor, your attacks deal 25% additional damage The Orb of Avarice Item Class: A Type: Magic Item Effect “Desire for Destruction”, Doubles magic Mana. Baruka’s Dagger One of Baran’s Drops Item Class: A Type: Dagger +110 Attack, Agility +10 Devil King's Dagger One of Baran’s Drops Item Class: S Type: Dagger +220 Attack Set effect ‘Two in One’: Attack = Strength + Dagger’s Attack. The Long Sword of the Demon King Baran Item Class: S Type: Dagger +350 Attack Effect “Whitish Storm”: It summons lighting every time the bearer swings the sword, Kamish’s Wrath: Item Class: ??? Type: Dagger +1,500 Attack Jin-Woo's Equipment Warden’s Necklace Item: Class A Type: Necklace Agility +20, Sense +20 High Knight’s Chestplate Acquired during the Job Change Quest (Manhwa: Chapter 38) Item Class: B Type: Armor +7% physical damage reduction (slow movement speed if your strength is below 80) High Knight’s Gauntlet Acquired during the Job Change Quest (Manhwa: Chapter 38) Item Class: B High Knight’s Ring Acquired during the Job Change Quest (Manhwa: Chapter 38) Item Class: B High Magicien Ring Acquired during the Job Change Quest (Manhwa: Chapter 38) Item Class: B Archer’s Gloves Acquired during the Job Change Quest (Manhwa: Chapter 38) Item Class: C Assassin’s Boots Acquired during the Job Change Quest (Manhwa: Chapter 38) Items Class: B Red Knight’s Helmet A drop after defeating Igris (Manhwa: Chapter 40) Item Class: S Type: Armor +15% Physical Damage Reduction +20 Stamina, +20 Strength Demon Monarch's Earring Acquired during the Demon Castle Quest (Manhwa: Chapter 60) Item Class: S Type: Accessory Strength +20, Vitality +20 Set: The Crown Jewels of the Monarch of Demons Demon Monarch’s Earring Demon Monarch’s Necklace Demon Monarch’s Ring Set Bonus: Set bonus effect 1. All Stats +5 (2 Items) Set bonus effect 2. All Stats +10 (3 Items) Demon Monarch's Necklace Acquired during the Demon Castle Quest (Manhwa: Chapter 61) Item Class: S Type: Accessory Agility +20, Intelligence +20 Set: The Crown Jewels of the Monarch of Demons Demon Monarch’s Earring Demon Monarch’s Necklace Demon Monarch’s Ring Set Bonus: Set bonus effect 1. All Stats +5 (2 Items) Set bonus effect 2. All Stats +10 (3 Items) Demon Monarch's Ring cquired during the Demon Castle Quest (Manhwa: Chapter 88) Item Class: S Type: Accessory Perception +20, Intelligence +20 Set: The Crown Jewels of the Monarch of Demons Demon Monarch’s Earring Demon Monarch’s Necklace Demon Monarch’s Ring Set Bonus: Set bonus effect 1. All Stats +5 (2 Items) Set bonus effect 2. All Stats +10 (3 Items) Potions Rasaka’s Venom Item Class: A Effect “Rasaka’s Steel Scales”: -20% Physical Damage Taken Debuff “ Weakened Muscles”: -35 Strength Mana Potion Item Class: E Type: Consumable +500 Mana after consumption Healing Potion Item Class: E Type: Consumable Restores a bit of Health after consumption. Holy Water of Life Acquired During the Demon Castle Quest (Manhwa: Chapter 88) Item Class: S Type: Consumable A potion that can cure any disease Items Dungeon Key Item Class: E Type: Key Raikan's Fang Item Class: None Type: Junk Leather Pouch Type: Container Pouch to carry money Bandages Warm Fur Coat Warm Gloves Demon Castle Key Item Class: S Type: Key Warm Fur Coat Item Class: S Type: Key Castle Door Key Item Class: A Type: Key Cerberus Fang Item Class: None Type: Material Volcan’s Horn World Tree Fragment Acquired During the Demon Castle Quest (Manhwa: Chapter 60) Item Class: ??? Type: Ingredient Spring Water of the Echoing Forest Acquired During the Demon Castle Quest (Manhwa: Chapter 61) Item Class: ??? Type: Ingredient Purified Blood of Demon King Acquired During the Demon Castle Quest (Manhwa: Chapter 88) Item Class: ??? Type: Ingredient Titles Wolf Slayer This title was given to Sung-Woo after he mastered the art of killing wolves. But it has its benefits. The Wolf Slayer title increases Jin-Woo’s proficiency by 40% if he’s fighting a beast. (Manhwa: Chapter 14) The one who overcame adversity A title given to those who persevere and fight against the odds heroically. Your stats will increase according to the health that you lost during the battle. +1% stat every -1% HP (Manhwa: Chapter 45) Summons Igris He is the shadow extracted from the defeated Blood-Red Commander Igris during the Job Change Quest (Manhwa: Chapter 40) He was upgraded and given the title Elite Knight. He is on the level of an S-Rank Hunter and he is the second strongest summon after Beru. Abilities Dominator’s Touch Regeneration Tank: He is the shadow of the alpha of the ice bears that Jin-Woo faced and defeated in a Red-Gate during the recruit training of the “ Tiger ” Guild (Manhwa: Chapter 51) . He was upgraded to the title of “ Knight ” and can be considered as strong as an A-Rank Hunter. Hunter Kim Chul Abilities Regeneration Iron: He is the shadow of A-Rank Hunter Kim Chul, one of the recruits of the “Tiger” Guild that was trapped in the Red-Gate with Sung Jin-Woo. He died because of Sung’s scheme. Sung purposely tries to make him attack at an unreasonable moment so he would die and be turned into a shadow (Manhwa: Chapter 54) . Like Igris he possesses the Title of “Elite Knight” and the power that rivals an S-Rank. Tusk This summon is the shadow of Kargalgan, the Final Boss of the A-Rank Dungeon that Sung Jin-Woo entered as a porter with the “Hunters” Guild (Manhwa: Chapter 75) . He is at the S-Rank level and has the widest set of abilities. He can attack and defend. A great Magician that turned out to be an invaluable asset. Abilities Levitation: He can levitate any target and uses this power as a weapon by slamming and crashing his enemies on hard surfaces Regeneration Hymn of Protection: He can materialize a shield to protect himself, the person of his choice or trap his enemies in it. Hymn of the Fire Dragon: The ability to shoot fire from his mouth. Hymn of the Blazing Fire: Fires multiple fireballs simultaneously. Hymn of Agony: A curse that will conjure agonizing pain upon his enemies. Hymn of Frenzy: The ability to weaken his opponent’s defenses. Hymn of Blindness: A curse that will completely bring down his target. Hymn of Slumber: A curse that will slowly drain the target’s stamina. Hymn of Petrification: The ability to petrify his enemies. Hymn of Rage Hymn of Strengthening: The ability to increase his, or a person of his choice, strength. Hymn of Giants: Tusk can increase his size and turn into a Giant. Hymn of Combustion Kaisel Kaisel is a dragon or a wyvern, his real name was Kaisellin and he was King Baran’s servant and mount (Manhwa: Chapter 88) . He is now the main mode of transportation of Sung Jin-Woo. He is able to travel colossal miles at astonishing speed and because he is a shadow he never gets tired. His strength is not to be taken lightly. Abilities Unknown Beru He is the shadow extracted from the Ant King during the Jeju Island Raid. He is the strongest shadow possessed by Sung-Jin-Woo and the only one with the ability to talk. He gained the title of “Marshal” and can be considered a class above S-Rank (Manhwa: Chapter 105). Abilities Colossal Physical Strength Conversation: The ability to talk. Regeneration Gluttony: The ability to steal the skill of his defeated opponents Flight Size Manipulation : By increasing his size, by sacrificing a bit of speed and agility he can gain strength. The opposite also works. By decreasing his size and sacrificing strength he can gain more agility and speed. Paralysis Poison: Spit a poison so toxic that it can kill his opponent in a matter of seconds. Healing Magic More Beru Info Jima He is Boss Naga’s shadow. The first Boss that Sung Jin-Woo defeated during his first official Raid after he established his own Guild (Manhwa: Chapter 122) . Sung stated that he is as strong as Tusk which makes him S-Rank level. Abilities Growth Regeneration Greed Greed: He is the shadow of Hwang Dong-Su, an S-Rank Hunter that ignited Sung Jin-Woo’s wrath after beating to death his Vice-Guild Master and the person he considers his younger brother, Yoo Jin-Ho. He was killed by Sung’s hands and turned into a shadow as punishment (Manhwa: Chapter 147) . He owns the Rank of “General” and in terms of sheer strength, he is only surpassed by Beru. Abilities Conversation Regeneration Kamish Kamish is humanity’s worst calamity. He is the monster that broke out of the first S-Rank Gate that ever appeared. Kamish devastated American’s Coasts, killed five S-Rank Hunters, and the National Level Hunters still tremble in remembrance of the event. His magic power is overwhelming and his strength cannot even be described. Sung Jin-Woo managed to extract his shadow but only for a few minutes as too much time had passed before he did so (Manhwa: Chapter 143). Abilities Colossal Physical Strength Conversation Dragon’s Fear Dragon’s Breath: Shooting fire from his mouth Quests The Courage of the Weak Sung had to clear that quest when he was still the weakest E-Rank Hunter, an S-Rank Quest that he miraculously survived and cleared . This is the quest he found in the Double Dungeon and the Quest that made him a “ Player ”. Demon Castle During this Quest, aside from obtaining great equipment and making the acquaintance of a Monster called Esil, and befriending her, he found the recipe for the Holy Water of Life that woke her mother from the eternal slumber . Job Change The Job Change Quest, after clearing it, gave him the job of a Necromancer , the Necromancer job was soon updated to Shadow Monarch . This Quest is what gave him the ability to become a One-Man Guild and the King of the immortal Shadow Army . STRONGEST Solo Leveling Characters Relationships/Family Park Kyung-Hye She is Sung Jin- Woo’s mother and the main reason why he decided to work as Hunter. She was struck by the disease “Eternal Slumber”. As the name suggests, it puts the affected in a sort of coma that they cannot rise from. They have to stay connected to a very expensive machine to stay alive. During the Demon Castle Quest, Sung found a recipe for the Holy Water of Life , a potion that can cure any illness and he saved his mother after defeating Baran , one of the Monarchs. When she opened her eyes the first thing she did was thank his son for taking such good care of his sister all on his own. More Park Kyung-Hye Sung Il-Hwan He is Sung Jin-Woo’s father and he disappeared in a Dungeon 10 years ago. He reappeared in a Gate in America with the magical energy of a Monster . He turned out to be one of the Rulers Vessels . Because he is aware of the power he possesses he can use the full power of his fragment. He also has extensive knowledge of the situation and what might happen in the future. He is also aware that his son is the Shadow Monarch even if he never left the Dungeon in the 10 years he was missing. Because of his disappearance , Sung had to take his place and take care of his family , a task that was not a walk in the park with the level that he was at in the beginning. More Sung Il-Hwan Sung Jin-Ah She is Sung’s sister . She is the one who chose the Guild name, “ AhJin ”, her Chapter name in reverse . In her eyes, Sung was like a father . He was the one she relied on to protect her and he was the one attending the parent-professors meeting. Her love for him is only matched by the reciprocated love her brother has for her. When she was attacked by orcs at her school, and Sung was in a Raid , he left everything and rushed to her side to rescue her. When he saw that the orcs dared to touch her, he entered a state of pure rage that even Beeru could sense from the Dungeon he was still in. Cha Hae-in A lot of girls had their sights on Sung, but the only one he ever showed any interest in was Hunter Cha, an S-Rank Hunter that he first met during a Raid where he posed as a porter . Cha has a very sensitive nose and cannot stand the stench of Monsters and Hunters alike, the only person she can smell and even like his odor is Sung’s . When she witnessed his strength her curiosity towards him turn into a romantic interest. She even wanted to leave the “Hunter’s” Guild and her position and Vice-Guild Master to enter Sung’s Guild instead. He also considers her a friend and the only person he can think of when he wants to do something mundane. He invited her to go to the amusement park where his father disappeared and showed her magnificent views on a ride on Kaisel . More Cha Hae In Yoo Jin-Ho He is the Vice-Guild Master of Sung’s Guild. He is the first person who saw what Sung was capable of. During the first Raid they went together, the other Guild members turned on Sung and wanted to kill him, Yoo knew that Sung was stronger than he was and even so, he decided to protect him. His kind heart is what made Sung so fond of him. When he confessed that he looked at Sung like an older brother , Sung decided to consider him his younger brother as well. Furthermore, when his father offered him to become the Guild Master of the Guild he was creating, he refused to be the right hand of Sung instead. Final Verdict Although one of the main antagonists of the Tokyo Revengers Series, Izana Kurokawa is undoubtedly a very interesting character. It would come as a shock to some readers when they find out that Mikey has a half-brother and they would eventually go head to head. Izana Kurokawa has a substantial influence on the series, especially in how Takemichi will try to fix the past. References 1. Chapter 1 2. Chapter 11 3. Chapter 14 4. Chapter 17 5. Chapter 34 6. Chapter 38 7. Chapter 40 8. Chapter 45 9. Chapter 51 10. Chapter 54 11. Chapter 60 12. Chapter 61 13. Chapter 75 14. Chapter 82 15. Chapter 88 16. Chapter 105 17. Chapter 106 18. Chapter 109 19. Chapter 122 20. Chapter 130 21. Chapter 139 22. Chapter 140 23. Chapter 143 24. Chapter 147 25. Chapter 149 26. Chapter 153 About The Author Mélissa Nassif Post navigation ← Previous Post Next Post → Related Posts 9+ Powerful Gintama Quotes (Images) Leave a Comment / Gintama , Action , Aniplex , Audio Highs , Comedy , Crunchyroll , Dentsu , Historical , Miracle Robo , Parody , PG-13 - Teens 13 or older , Samurai , Sci-Fi , Sentai Filmworks , Shounen , Shueisha , Spring 2006 , Sunrise , Trinity Sound , TV Tokyo / By Ernie /  July 28, 2022 11+ Powerful Mobile Suit Gundam: Iron-Blooded Orphans Quotes Leave a Comment / Action , Adventure , Anime Quotes , Fall 2015 , Mainichi Broadcasting System , Mecha , Military , Mobile Suit Gundam: Iron-Blooded Orphans , Quotes by Anime , R - 17+ (violence & profanity) , Sci-Fi , Sotsu , Space , Sunrise / By Matt /  February 16, 2020 49+ POWERFUL Madara Uchiha Quotes (HQ Images) Leave a Comment / Action , Adventure , Anime Quotes , Aniplex , Comedy , Fall 2002 , Martial Arts , Naruto , Naruto Quotes , PG-13 - Teens 13 or older , Quotes by Anime , Shounen , Shueisha , Studio Pierrot , Super Power , TV Tokyo , Viz Media / By Matt /  July 28, 2022 35+ POWERFUL Action Manhwa (Korean) to READ! 1 Comment / Recommendations , Action , Genres , Manhwa / By Mélissa Nassif /  July 27, 2022 Roxy Migurdia | Mushoku Tensei (WIKI) Leave a Comment / Wiki | INFO , Action , Magic , Mushoku Tensei / By humarifat /  August 7, 2022 29+ Best Action Manga To Read (Recommendations) 1 Comment / Recommendations , Action , Manga / By saaddhillon /  July 22, 2022 Takashi Mitsuya | Tokyo Revengers Wiki (INFO) 1 Comment / Tokyo Revengers , Wiki | INFO / By Ernie /  August 10, 2022 Ken Wakui Wiki | Author of Tokyo Revengers Leave a Comment / Author , Tokyo Revengers , Wiki | INFO / By Ernie /  August 9, 2022 Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Δ Newest Posts ALL 9 Monarchs & Gods in Solo Leveling Ranked & Explained! April 17, 2024 What Is The Limiter?! November 20, 2023 Ryomen Sukuna Is Not Evil?! November 13, 2023 The Gorosei Are Not Gods! November 6, 2023 He Defeated Sukuna In The Past?! October 17, 2023 Who Will Defeat Ryomen Sukuna?! October 1, 2023 He Is Stronger Than Yuta?! September 29, 2023 Luffy’s Future Is Written On His Shirt?! September 25, 2023 Is Gojo Right About His Students?! September 20, 2023 28 One Piece Moments That Became Viral Memes May 26, 2024 Join us on Discord drop us a line and  chat with people like yourself in the Community Join discord Blog Contact Us Terms & Conditions Affiliate Terms About Us Join the Team CONTACT US Copyright Privacy Policy Affiliates Policy Link Tree Scroll to Top English"
  },
  "https://www.dexerto.com/anime/solo-leveling-who-is-sung-jin-woo-powers-abilities-explained-2461919/": {
    "url": "https://www.dexerto.com/anime/solo-leveling-who-is-sung-jin-woo-powers-abilities-explained-2461919/",
    "content": "Solo Leveling: Who is Sung Jin-Woo? Powers & abilities explained - Dexerto Gaming Popular View All Games Call of Duty Pokemon Overwatch Fortnite Destiny Marvel Rivals GTA Monster Hunter Wilds More Gaming EA Sports FC Valorant Apex Legends League of Legends Diablo Counter-Strike 2 Genshin Impact Honkai Star Rail Roblox Deadlock Baldur's Gate Minecraft World of Warcraft Palworld TV & Movies Popular Daredevil Invincible Severance Yellowstone DC Anime True Crime Horror More TV & Movies Netflix Apple TV Hulu Prime Video Disney+ Entertainment Entertainment View All Entertainment YouTube Twitch Kick TikTok More Entertainment Viral Esports Esports Call of Duty Valorant League of Legends Counter-Strike 2 Apex Legends All Esports More More Archive About Us Advertise With Us Log in Sign up Gaming Popular View All Games Call of Duty Pokemon Overwatch Fortnite Destiny Marvel Rivals GTA Monster Hunter Wilds More Gaming EA Sports FC Valorant Apex Legends League of Legends Diablo Counter-Strike 2 Genshin Impact Honkai Star Rail Roblox Deadlock Baldur's Gate Minecraft World of Warcraft Palworld TV & Movies Popular Daredevil Invincible Severance Yellowstone DC Anime True Crime Horror More TV & Movies View All TV & Movies Netflix Apple TV Hulu Prime Video Disney+ Entertainment Entertainment View All Entertainment YouTube Twitch Kick TikTok More Entertainment Viral Esports Esports Call of Duty Valorant League of Legends Counter-Strike 2 Apex Legends All Esports More More Archive About Us Advertise With Us Trending Schedule 1 Severance Twitch Warzone Invincible Marvel Rivals TV & Movies Anime Solo Leveling: Who is Sung Jin-Woo? Powers & abilities explained by Aparna Ukil Published: Jan 07, 2024, 11:27 Save for later Save for later Sung Jin-Woo is a manhwa character in Solo Leveling who appears extremely weak in the beginning. However, his encounter with a powerful entity called ‘God’ changes his life by providing him with the abilities he always lacked as a hunter. Here’s everything you should know about Solo Leveling’s main protagonist. The long-awaited anime adaptation of the popular Korean manhwa has premiered globally and it has everything that we could’ve asked for, be it the top-level visual dynamics or the gripping narrative. Article continues after ad Solo Leveling follows Sung Jin-Woo, who comes out to be frail and the weakest protagonist at the start. However, over time Jin-Woo’s powers start enhancing mysteriously and he becomes a one-man army who is impossible to defeat. So, who is Sung Jin-Woo and what powers and abilities does he boast? Let’s find out. Who is Sung Jin-Woo? When the story of Solo Leveling commences, we meet a hunter named Sung Jin-Woo, who is known as ‘Humanity’s Weakest Hunter’. Even though he lacks physical strength, his strong wit since the beginning saved the remaining members from getting killed in their first Dungeon. Article continues after ad Article continues after ad The story introduces him as an E-rank hunter who hasn’t come uninjured out of any battle. He is someone who gets knocked out even by the weakest monsters. However, things change for him when he almost gets brutally killed at a Dungeon where he loses a major part of his party. Apparently, his party enters a Dungeon thinking that it’s an E-Class mission but turns out that it is an S-Class Dungeon. Solo Leveling Episode 1 Looks so good! 🔥 #SoloLeveling pic.twitter.com/aTQm98hKzt — Khalid (@Rm_5aled) January 6, 2024 When we thought this was his end, the young hunter awakens only to stun everyone with the newly found abilities granted to him by ‘God’. He gets to access a mysterious gaming-like interface called System that becomes visible only to his eyes. Related Solo Leveling: Arise codes (January 2025) – How to redeem, Draw Tickets & Gold Article continues after ad The platform gives him the ability to get stronger over time, very much like an RPG game , where he has to perform different tasks and fight monsters to level up. He also gets access to multiple new weapons during his quest to become the strongest Hunter. Article continues after ad What are Sung Jin-Woo’s powers & abilities? After coming across the System, Sung Jin-Woo gets an exceptional hold on his speed and physical strength. The one who was once mocked for being a good-for-nothing hunter by every member of his party eventually becomes an unstoppable being who is enough to take a bunch of monsters down on his own. Thanks to the potent RPG-like interface that helps him level up with each successful quest. Article continues after ad The System The System lets Sung Jin-Woo keep track of the status of his physical/mental health, energy, necromancy, and more. He can also stay aware of how much inventory he is left with, how much of his powers have been upgraded or what are his achievements. Shadows Sung Jin-Woo also has the potential to turn the defeated opponents into his allies (known as Shadows), who help him in the battles using the powers that they had before getting knocked down. Adding to that, he can also store the Shadows and use/diminish their existence at his will. Article continues after ad Article continues after ad Manhwa readers know that this  Anime is going to break the internet 🔥 #SoloLeveling pic.twitter.com/Hn2Ew2GppW — ᗩᑎIᗰE ᕼᑌᗷ 👑 (@AnimeHubDaily) January 5, 2024 Ruler’s Authority Using the Ruler’s Authority, he can use the Shadows to craft weapons or increase his movements. In short, Jin-Woo can store his army and weapons in his Shadow, which allows him to summon his soldiers or access any of his weapons out of nowhere. Healing Moreover, with all these powers comes the healing ability that allows him to regenerate from the most severe injuries in no time. In the final stages of the story, Sung Jin-Woo becomes the one with God-like abilities that grant him the potency to even bring the dead back to life. Article continues after ad Stealth That’s not the end of Jin-Woo’s abilities as he can also execute stealth attacks by erasing his presence. So, it becomes almost impossible for any opponent to detect Jin-Woo, and they become easy prey for our overpowered protagonist. Jin-Woo’s abilities are limited when he starts using “The System” granted by the “God.” He gets very few resources and has to perform every task carefully. But over time, Jin-Woo gathers several resources and reaches a level where he can control entire Shadow armies and even alter reality. In the end, Jin-Woo becomes a supernatural entity who can even defeat “Gods.” Article continues after ad Article continues after ad Finally got to watch Solo Leveling & first episode is beautifully adapted. I'm genuinely impressed with how the action scenes turned out. Plus the additions to story, visuals & music is pretty good too Its listed for 12 episodes & I pray they don't rush it like God of Highschool pic.twitter.com/kQhCBirBx9 — Myamura (@Go_Jover) January 7, 2024 Of course, fans who read the Korean Manhwa know all about Jin-Woo’s long yet fascinating journey. However, anime-only fans have yet to see Jin-Woo becoming an indestructible force who’s fighting on Humanity’s behalf. In the initial phase of Jin-Woo’s journey, you’ll see him accepting his newly found powers and being as sensitive and considerate as always, but after a few episodes , Jin-Woo will turn into someone else entirely. For the humans, he’ll be a myth, an angel sent by God, and for some he’ll be the “God’s reincarnation.” Article continues after ad You can check out our other anime coverage here . keep reading Gaming Don’t wait for Solo Leveling Season 3 — play as Sung Jinwoo in the amazing free game Anime 20 best anime like Solo Leveling you should watch next Gaming Solo Leveling Arise hunter tier list – Best characters ranked Fortnite Fortnite x Solo Leveling collaboration leaks and details Gaming Marvel Rivals Moon Knight guide: Abilities, ultimate, tips, more Anime The Solo Leveling live-action adaptation needs to learn 3 lessons from One Piece Gaming Solo Leveling Arise: What is the current banner & who will be next? Anime Solo Levelling Season 2 premiere recap – Jinwoo is more powerful than ever Sign up to Dexerto for the latest news, views & reviews Better Reading Experience | Save Your Favourite Items Sign up About About Dexerto: Editorial staff, standards and policies Advertise with us Editorial Staff Privacy Cookies Policy Privacy Policy Terms and Conditions Acceptable Use Policy Contact Contact Us © Copyright 2025 Dexerto Ltd. All rights reserved."
  }
}